<?xml version="1.0" encoding="iso-8859-1"?>
<rss version="2.0"><channel><title>qs.github.io</title><link>http://qs.github.io</link><description></description><lastBuildDate>Sun, 13 Jul 2014 16:25:37 GMT</lastBuildDate><generator>PyRSS2Gen-1.1.0</generator><docs>http://blogs.law.harvard.edu/tech/rss</docs><item><title>Awesome github lists</title><link>http://qs.github.io13-07-2014/awesome-github-lists.html</link><description>&lt;p&gt;&#1053;&#1072; &#1075;&#1080;&#1090;&#1093;&#1072;&#1073;&#1077; &#1087;&#1086;&#1096;&#1083;&#1072; &#1074;&#1086;&#1083;&#1085;&#1072; &#1078;&#1080;&#1074;&#1099;&#1093; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1074; &#1092;&#1088;&#1077;&#1081;&#1084;&#1086;&#1088;&#1082;&#1086;&#1074; &#1087;&#1086;&#1076; &#1088;&#1072;&#1079;&#1085;&#1099;&#1077; &#1103;&#1079;&#1099;&#1082;&#1080; &#1080; &#1094;&#1077;&#1083;&#1080;:&lt;/p&gt;

&lt;ul&gt;
	&lt;li&gt;&lt;a href="https://github.com/bayandin/awesome-awesomeness"&gt;Awesome Awesomeness&lt;/a&gt; - &#1084;&#1077;&#1090;&#1072;&#1089;&#1087;&#1080;&#1089;&#1086;&#1082;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&#1048;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1077; &#1084;&#1085;&#1077;:&lt;/p&gt;

&lt;ul&gt;
	&lt;li&gt;&lt;a href="https://github.com/vinta/awesome-python"&gt;Awesome Python&lt;/a&gt;&lt;/li&gt;
	&lt;li&gt;&lt;a href="https://github.com/alebcay/awesome-shell"&gt;Awesome Shell&lt;/a&gt; - &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100;, &#1082;&#1072;&#1082;&#1080;&#1077; &#1077;&#1097;&#1077; &#1082;&#1083;&#1077;&#1074;&#1099;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1077;&#1089;&#1090;&#1100;&lt;/li&gt;
	&lt;li&gt;&lt;a href="https://github.com/dypsilon/frontend-dev-bookmarks"&gt;Frontend Development&lt;/a&gt; - &#1082;&#1091;&#1095;&#1072; &#1075;&#1072;&#1081;&#1076;&#1086;&#1074;, &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082; js, &#1077;&#1089;&#1090;&#1100; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083; &#1074;&#1077;&#1088;&#1089;&#1090;&#1082;&#1080; &#1087;&#1086;&#1076; &#1084;&#1086;&#1073;&#1080;&#1083;&#1100;&#1085;&#1099;&#1077; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&lt;/li&gt;
	&lt;li&gt;&lt;a href="https://github.com/onurakpolat/awesome-bigdata"&gt;Awesome Big Data&lt;/a&gt; - &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1082;&#1091;&#1095;&#1072; &#1074;&#1089;&#1077;&#1075;&#1086; &#1086;&#1090; Apache, &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1093; &#1089;&#1090;&#1072;&#1090;&#1077;&#1081;&lt;/li&gt;
	&lt;li&gt;&lt;a href="https://github.com/youngwookim/awesome-hadoop"&gt;Awesome Hadoop&lt;/a&gt; - &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1087;&#1088;&#1086; &#1074;&#1089;&#1077;, &#1095;&#1090;&#1086; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1086; &#1089; Hadoop&lt;/li&gt;
	&lt;li&gt;&lt;a href="https://github.com/kahun/awesome-sysadmin"&gt;Awesome Sysadmin&lt;/a&gt; - &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1080;&#1085;&#1092;&#1088;&#1072;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1099;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&#1045;&#1097;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1088;&#1072;&#1079;&#1086;&#1073;&#1088;&#1072;&#1090;&#1100;&#1089;&#1103;, &#1082;&#1072;&#1082;&#1086;&#1081; &#1076;&#1074;&#1080;&#1078;&#1086;&#1082; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1086;&#1074; &#1087;&#1080;&#1090;&#1086;&#1085;&#1072; &#1083;&#1091;&#1095;&#1096;&#1077;. AngularJS &#1080; &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090; &#1089;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1083;&#1077;&#1075;&#1082;&#1086; &#1087;&#1091;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; Jinja2. Mako &#1074;&#1088;&#1086;&#1076;&#1077; &#1076;&#1072;&#1078;&#1077; &lt;a href="http://stackoverflow.com/questions/1324238/what-is-the-fastest-template-system-for-python"&gt;&#1073;&#1099;&#1089;&#1090;&#1088;&#1077;&#1077;&lt;/a&gt;.&lt;/p&gt;</description><guid isPermaLink="true">http://qs.github.io13-07-2014/awesome-github-lists.html</guid><pubDate>Sun, 13 Jul 2014 15:58:00 GMT</pubDate></item><item><title>&#1044;&#1086;&#1095;&#1080;&#1090;&#1072;&#1083; &#1056;&#1077;&#1092;&#1072;&#1082;&#1090;&#1086;&#1088;&#1080;&#1085;&#1075;. &#1059;&#1083;&#1091;&#1095;&#1096;&#1077;&#1085;&#1080;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072;</title><link>http://qs.github.io11-07-2014/dochital-refaktoring-uluchshenie-suschestvuyuschego-koda.html</link><description>&lt;p&gt;&#1044;&#1086;&#1095;&#1080;&#1090;&#1072;&#1083; "&#1056;&#1077;&#1092;&#1072;&#1082;&#1090;&#1086;&#1088;&#1080;&#1085;&#1075;. &#1059;&#1083;&#1091;&#1095;&#1096;&#1077;&#1085;&#1080;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072;". &#1052;&#1077;&#1085;&#1077;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1072;&#1103;, &#1095;&#1077;&#1084; "&#1057;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076;", &#1086;&#1090;&#1095;&#1072;&#1089;&#1090;&#1080; &#1080;&#1079;-&#1079;&#1072; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1103;&#1090; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1076;&#1083;&#1103; Java/C++ &#1095;&#1077;&#1084; &#1076;&#1083;&#1103; Python, &#1085;&#1086; &#1080; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1072;&#1103;. &#1055;&#1086;&#1082;&#1072; &#1095;&#1080;&#1090;&#1072;&#1083;, &#1089;&#1090;&#1072;&#1083; &#1083;&#1091;&#1095;&#1096;&#1077; (&#1082;&#1072;&#1082; &#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103;) &#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1081; &#1082;&#1086;&#1076;, &#1089;&#1090;&#1072;&#1083; &#1091;&#1074;&#1077;&#1088;&#1077;&#1085;&#1077;&#1077; &#1074;&#1085;&#1086;&#1089;&#1080;&#1090;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;. &#1052;&#1085;&#1077;, &#1091;&#1074;&#1099;, &#1087;&#1086;&#1082;&#1072; &#1095;&#1072;&#1089;&#1090;&#1086; &#1085;&#1091;&#1078;&#1077;&#1085; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1091;&#1089;&#1087;&#1077;&#1093;&#1072;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1080;&#1090;&#1100; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1082; &#1085;&#1077;&#1084;&#1091; &#1074;&#1077;&#1076;&#1091;&#1090;.&lt;/p&gt;

&lt;p&gt;&#1055;&#1086;&#1085;&#1088;&#1072;&#1074;&#1080;&#1083;&#1080;&#1089;&#1100; &#1080;&#1076;&#1077;&#1080;:&lt;/p&gt;

&lt;ul&gt;
	&lt;li&gt;&#1071;&#1079;&#1099;&#1082; &#1088;&#1077;&#1092;&#1072;&#1082;&#1090;&#1086;&#1088;&#1080;&#1085;&#1075;&#1086;&#1074; (&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1073;&#1086;&#1083;&#1077;&#1077; &#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103;): &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1077; &#1088;&#1077;&#1092;&#1072;&#1082;&#1090;&#1086;&#1088;&#1080;&#1085;&#1075;&#1080; &#1074; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077; &#1082;&#1088;&#1091;&#1087;&#1085;&#1099;&#1093; - &#1086;&#1095;&#1077;&#1085;&#1100; &#1091;&#1076;&#1086;&#1073;&#1085;&#1086;.&lt;/li&gt;
	&lt;li&gt;&#1063;&#1072;&#1089;&#1090;&#1086;&#1077; &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;, &#1087;&#1086;&#1096;&#1072;&#1075;&#1086;&#1074;&#1099;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080;, &#1095;&#1077;&#1088;&#1077;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1088;&#1080;&#1074;&#1099;&#1082;&#1072;&#1077;&#1096;&#1100; &#1084;&#1099;&#1089;&#1083;&#1080;&#1090;&#1100; &#1074; &#1090;&#1072;&#1082;&#1086;&#1084; &#1078;&#1077; &#1076;&#1091;&#1093;&#1077; &#1080; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103; &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1086;, &#1082;&#1072;&#1082; &#1080; &#1095;&#1090;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1076;&#1072;&#1083;&#1100;&#1096;&#1077;.&lt;/li&gt;
	&lt;li&gt;&#1057;&#1085;&#1086;&#1074;&#1072; &#1087;&#1088;&#1086;&#1087;&#1072;&#1075;&#1072;&#1085;&#1076;&#1080;&#1088;&#1091;&#1077;&#1090;: &#1087;&#1072;&#1088;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;, &#1085;&#1077;&#1076;&#1077;&#1083;&#1072;&#1085;&#1080;&#1077; &#1095;&#1077;&#1075;&#1086;-&#1090;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1085;&#1077;&#1090; &#1087;&#1086;&#1083;&#1085;&#1086;&#1081; &#1091;&#1074;&#1077;&#1088;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080; &#1074; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103;&#1093;, &#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1089;&#1077;&#1073;&#1077; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1077; &#1094;&#1077;&#1083;&#1080; &#1074; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1077; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093;.&lt;/li&gt;
&lt;/ul&gt;</description><guid isPermaLink="true">http://qs.github.io11-07-2014/dochital-refaktoring-uluchshenie-suschestvuyuschego-koda.html</guid><pubDate>Fri, 11 Jul 2014 23:57:00 GMT</pubDate></item><item><title>Webpunk</title><link>http://qs.github.io09-07-2014/webpunk.html</link><description>&lt;p&gt;&#1048;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1081; &#1078;&#1072;&#1085;&#1088;. &#1063;&#1090;&#1086;-&#1090;&#1086; &#1090;&#1080;&#1087;&#1072; &#1084;&#1080;&#1089;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; web 1.0, windows 95, &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1089; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1086;&#1084; &#1091;&#1077;&#1076;&#1080;&#1085;&#1103;&#1083;&#1080;&#1089;&#1100;, &#1086;&#1085; &#1085;&#1077; &#1073;&#1099;&#1083; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072;&#1083;&#1086;&#1084; &#1076;&#1083;&#1103; &#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;. &#1055;&#1086;&#1084;&#1080;&#1084;&#1086; &#1089;&#1072;&#1084;&#1086;&#1075;&#1086; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1082;&#1072;&#1090;&#1100; &#1087;&#1086; &#1093;&#1101;&#1096;&#1090;&#1077;&#1075;&#1072;&#1084;: #seapunk, #icepunk&lt;/p&gt;

&lt;p&gt;&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;:&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&lt;a href="http://w-o-s.ru/article/3062"&gt;&#1044;&#1086;&#1073;&#1088;&#1086; &#1087;&#1086;&#1078;&#1072;&#1083;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1074;&#1077;&#1073;-&#1087;&#1072;&#1085;&#1082;&lt;/a&gt; - &#1089;&#1090;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; W&#8594;O&#8594;S, &#1074; &#1085;&#1077;&#1081; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1072; &#1087;&#1088;&#1086;&#1095;&#1077;&#1077;: &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1074; &#1082;&#1086;&#1085;&#1090;&#1072;&#1082;&#1090;&#1077;, &#1089;&#1072;&#1091;&#1085;&#1076;&#1082;&#1083;&#1072;&#1091;&#1076;&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://journalist.masu.ru/index.php/works/2010-11-17-05-56-13/1130-2013-12-21-17-46-20"&gt;&#1042;&#1077;&#1073;-&#1087;&#1072;&#1085;&#1082;: &#1095;&#1090;&#1086; &#1101;&#1090;&#1086; &#1090;&#1072;&#1082;&#1086;&#1077; &#1080; &#1082;&#1072;&#1082; &#1082; &#1085;&#1077;&#1084;&#1091; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1100;&#1089;&#1103;&lt;/a&gt; - &#1086;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1090;&#1072;&#1090;&#1100;&#1103;&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://mtrpl.ru/rus-web-punk/"&gt;&#1048;&#1089;&#1090;&#1086;&#1088;&#1080;&#1103; &#1054;&#1090;&#1077;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072; &#8212; &#1082;&#1088;&#1072;&#1090;&#1082;&#1080;&#1081; &#1082;&#1091;&#1088;&#1089; &#1074;&#1077;&#1073;-&#1087;&#1072;&#1085;&#1082;&#1072;&lt;/a&gt; - &#1076;&#1077;&#1089;&#1103;&#1090;&#1086;&#1082; &#1090;&#1088;&#1101;&#1096;-&#1082;&#1083;&#1080;&#1087;&#1086;&#1074; &#1076;&#1083;&#1103; &#1074;&#1076;&#1086;&#1093;&#1085;&#1086;&#1074;&#1077;&#1085;&#1080;&#1103; &#1074; &#1076;&#1091;&#1093;&#1077; &#1074;&#1077;&#1073;-&#1087;&#1072;&#1085;&#1082;&#1072;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&#1052;&#1091;&#1079;&#1099;&#1082;&#1072;:&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&lt;a href="https://soundcloud.com/subwise"&gt;SUBWISE&lt;/a&gt; - &#1079;&#1076;&#1077;&#1089;&#1100; &#1082;&#1083;&#1072;&#1089;&#1089;&#1085;&#1099;&#1077; &#1087;&#1086;&#1076;&#1082;&#1072;&#1089;&#1090;&#1099;&lt;/li&gt;
	&lt;li&gt;&lt;a href="https://soundcloud.com/25indica"&gt;25indica&lt;/a&gt; - &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1086;&#1077;, &#1088;&#1072;&#1079;&#1085;&#1086;&#1077; &#1079;&#1074;&#1091;&#1095;&#1072;&#1085;&#1080;&#1077;, &#1079;&#1072;&#1073;&#1072;&#1074;&#1077;&#1085; &lt;a href="https://soundcloud.com/25indica/25indica-russian-porno-xxx"&gt;russian porno xxx juke&lt;/a&gt;&lt;/li&gt;
	&lt;li&gt;&lt;a href="https://soundcloud.com/ilzp"&gt;ILZP&lt;/a&gt; - &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1090;&#1080;&#1087;&#1080;&#1095;&#1085;&#1099;&#1081; &#1074;&#1077;&#1073;-&#1087;&#1072;&#1085;&#1082;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&#1050;&#1072;&#1088;&#1090;&#1080;&#1085;&#1082;&#1080;:&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&lt;a href="http://vk.com/webpunkk"&gt;WEBPUNK&lt;/a&gt; - &#1079;&#1076;&#1077;&#1089;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1072;&#1088;&#1086;&#1076;&#1072;&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://vk.com/terminaldream"&gt;T&#949;r&#1084;in&#945;&#8467; Dr&#926;&#945;m&lt;/a&gt; - &#1079;&#1076;&#1077;&#1089;&#1100; &#1073;&#1086;&#1083;&#1077;&#1077; &#1086;&#1088;&#1080;&#1075;&#1080;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077;&lt;/li&gt;
&lt;/ul&gt;</description><guid isPermaLink="true">http://qs.github.io09-07-2014/webpunk.html</guid><pubDate>Wed, 09 Jul 2014 01:24:00 GMT</pubDate></item><item><title>&#1056;&#1072;&#1079;&#1085;&#1099;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080;</title><link>http://qs.github.io05-07-2014/raznye-ssylki.html</link><description>&lt;ul&gt;
	&lt;li&gt;&lt;a href="http://www.quora.com/Billionaires/I-want-to-be-a-billionaire-in-2-years-how-can-I-plan-that"&gt;&#1050;&#1072;&#1082; &#1089;&#1072;&#1090;&#1100; &#1084;&#1080;&#1083;&#1083;&#1080;&#1086;&#1085;&#1077;&#1088;&#1086;&#1084; &#1079;&#1072; &#1076;&#1074;&#1072; &#1075;&#1086;&#1076;&#1072;&lt;/a&gt; - &#1074;&#1086;&#1087;&#1088;&#1086;&#1089; &#1085;&#1072; quora. &#1050;&#1072;&#1083;&#1100;&#1082;&#1091;&#1083;&#1103;&#1094;&#1080;&#1103;, &#1084;&#1086;&#1090;&#1080;&#1074;&#1072;&#1094;&#1080;&#1103;, &#1087;&#1077;&#1090;&#1088;&#1086;&#1089;&#1103;&#1085;&#1089;&#1090;&#1074;&#1086;.&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://metaoptimize.com/qa/questions/3163/good-machine-learning-blogs"&gt;Good Machine Learning Blogs&lt;/a&gt; - &#1085;&#1091;&#1078;&#1085;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1074; rss&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://web.appstorm.net/roundups/100-web-apps-to-rule-them-all/"&gt;111 Web Apps to Rule Them All&lt;/a&gt; - &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1077; &#1074;&#1077;&#1073;-&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1042; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1103;&#1093; &#1077;&#1097;&#1077;.&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://www.pixelprospector.com/the-big-list-of-postmortems/"&gt;collection of postmortems by indie developers and AAA studios&lt;/a&gt; - &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1080;&#1075;&#1088;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&#1048;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1099; &#1085;&#1072; &#1075;&#1080;&#1090;&#1093;&#1072;&#1073;&#1077;:&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&lt;a href="https://github.com/search?l=Python&amp;amp;p=2&amp;amp;q=stars%3A%3E300&amp;amp;ref=advsearch&amp;amp;type=Repositories"&gt;Python stars:&amp;gt;300&lt;/a&gt; - &#1092;&#1080;&#1083;&#1100;&#1090;&#1088; &#1087;&#1086;&#1087;&#1091;&#1083;&#1103;&#1088;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074; &#1085;&#1072; &#1087;&#1080;&#1090;&#1086;&#1085;&#1077;.&lt;/li&gt;
	&lt;li&gt;&lt;a href="https://github.com/vinta/awesome-python"&gt;Awesome Python&lt;/a&gt; - &#1087;&#1086;&#1076;&#1073;&#1086;&#1088;&#1082;&#1072; &#1092;&#1088;&#1077;&#1081;&#1084;&#1074;&#1086;&#1088;&#1082;&#1086;&#1074; &#1087;&#1086;&#1076; &#1088;&#1072;&#1079;&#1085;&#1099;&#1077; &#1085;&#1091;&#1078;&#1076;&#1099;&lt;/li&gt;
	&lt;li&gt;&lt;a href="https://github.com/kahun/awesome-sysadmin"&gt;Awesome Sysadmin&lt;/a&gt; - &#1087;&#1086;&#1076;&#1073;&#1086;&#1088;&#1082;&#1072; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1076;&#1083;&#1103; &#1072;&#1076;&#1084;&#1080;&#1085;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;&lt;/li&gt;
	&lt;li&gt;&lt;a href="https://github.com/karan/Projects"&gt;Mega Project List&lt;/a&gt; - &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1090;&#1080;&#1087;&#1080;&#1095;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1077;&#1089;&#1083;&#1080; &#1085;&#1077;&#1090; &#1074;&#1076;&#1086;&#1093;&#1085;&#1086;&#1074;&#1077;&#1085;&#1080;&#1103; &#1080; &#1080;&#1076;&#1077;&#1081;. &lt;a href="https://github.com/karan/Projects-Solutions"&gt;&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1081;&lt;/a&gt;&lt;/li&gt;
	&lt;li&gt;&lt;a href="https://github.com/sahat/hackathon-starter"&gt;Hackathon Starter Node.js&lt;/a&gt; - &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086; &#1087;&#1086;&#1076;&#1073;&#1086;&#1088;&#1082;&#1091; starter kits&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Starter kits:&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&lt;a href="https://github.com/pablomouzo/Django-Starter-Kit"&gt;Django Starter Kit&lt;/a&gt; - virtualenv, gitignore, sphinx, docstrings&lt;/li&gt;
	&lt;li&gt;&lt;a href="https://github.com/talwai/django-angular-starter"&gt;Django + AngluarJS starter kit&lt;/a&gt; - &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1073;&#1099; &#1089;&#1083;&#1080;&#1090;&#1100; &#1089; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1084;&lt;/li&gt;
&lt;/ul&gt;</description><guid isPermaLink="true">http://qs.github.io05-07-2014/raznye-ssylki.html</guid><pubDate>Sat, 05 Jul 2014 02:37:00 GMT</pubDate></item><item><title>&#1050;&#1080;&#1090;&#1072;&#1081;&#1089;&#1082;&#1072;&#1103; &#1089;&#1086;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1077;&#1090;&#1100; douban.com</title><link>http://qs.github.io04-07-2014/kitayskaya-sotsialnaya-set-douban-com.html</link><description>&lt;p&gt;&#1059;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1089;&#1077;&#1075;&#1086;&#1076;&#1085;&#1103; &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1082;&#1088;&#1091;&#1087;&#1085;&#1086;&#1081; &#1082;&#1080;&#1090;&#1072;&#1081;&#1089;&#1082;&#1086;&#1081; &#1089;&#1086;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1077;&#1090;&#1080; "&#1076;&#1083;&#1103; &#1080;&#1085;&#1090;&#1077;&#1083;&#1083;&#1080;&#1075;&#1077;&#1085;&#1090;&#1086;&#1074;" &lt;a href="http://www.douban.com"&gt;douban.com&lt;/a&gt;. &#1057;&#1088;&#1077;&#1076;&#1085;&#1077;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1092;&#1077;&#1081;&#1089;&#1073;&#1091;&#1082;&#1086;&#1084;, &#1080;&#1084;&#1093;&#1086;&#1085;&#1077;&#1090;&#1086;&#1084;, &#1077;&#1089;&#1090;&#1100; &#1084;&#1091;&#1079;&#1099;&#1082;&#1072;, &#1082;&#1072;&#1082; &#1074; &#1082;&#1086;&#1085;&#1090;&#1072;&#1082;&#1090;&#1077; - &#1082;&#1091;&#1095;&#1072; &#1074;&#1089;&#1077;&#1075;&#1086; &#1085;&#1072;&#1084;&#1077;&#1096;&#1072;&#1085;&#1086;.&lt;/p&gt;

&lt;p&gt;&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1088;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080; - &#1101;&#1090;&#1086; &#1082;&#1080;&#1090;&#1072;&#1081;&#1089;&#1082;&#1072;&#1103; &#1082;&#1072;&#1087;&#1090;&#1095;&#1072;. &#1056;&#1077;&#1096;&#1080;&#1090;&#1100; &#1077;&#1077; &#1090;&#1088;&#1091;&#1076;&#1085;&#1086;&#1074;&#1072;&#1090;&#1086;, &#1089;&#1089;&#1099;&#1083;&#1082;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100;:&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&lt;a href="http://www.nciku.com/search/radical?strokes=11"&gt;nciku.com/&lt;/a&gt; - &#1087;&#1086;&#1080;&#1089;&#1082; &#1087;&#1086; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1091;, &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1088;&#1072;&#1074;&#1076;&#1072; &#1087;&#1086;&#1076;&#1073;&#1080;&#1088;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1074; &#1087;&#1077;&#1088;&#1074;&#1091;&#1102; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100; &#1088;&#1080;&#1089;&#1091;&#1077;&#1090;&#1089;&#1103;&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://www.chinese-russian.com/zd/bs/"&gt;chinese-russian.com&lt;/a&gt; - &#1077;&#1097;&#1077; &#1086;&#1076;&#1080;&#1085; &#1084;&#1077;&#1085;&#1077;&#1077; &#1091;&#1076;&#1086;&#1073;&#1085;&#1099;&#1081; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://www.yellowbridge.com/chinese/character-dictionary.php"&gt;yellowbridge&lt;/a&gt; - &#1087;&#1086;&#1080;&#1089;&#1082; &#1087;&#1086; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102;, &#1085;&#1091;&#1078;&#1085;&#1086; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100; &#1072;&#1076;&#1073;&#1083;&#1086;&#1082;&#1077;&#1088;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&#1042;&#1072;&#1078;&#1085;&#1086; &#1074;&#1099;&#1103;&#1089;&#1085;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1088;&#1080;&#1089;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1074;&#1099;&#1084; - &#1101;&#1090;&#1086; &#1082;&#1083;&#1102;&#1095; - &#1082;&#1086;&#1088;&#1077;&#1085;&#1100; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1072;. &lt;/p&gt;

&lt;p&gt;&#1063;&#1090;&#1086; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074; douban:&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&#1050;&#1091;&#1095;&#1072; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1096;&#1090;&#1091;&#1082; &#1082; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1080;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1080; &#1083;&#1072;&#1081;&#1082;&#1072;&#1090;&#1100;: &#1092;&#1080;&#1083;&#1100;&#1084;&#1099;, &#1084;&#1091;&#1079;&#1099;&#1082;&#1072;, &#1082;&#1085;&#1080;&#1075;&#1080;, &#1075;&#1088;&#1091;&#1087;&#1087;&#1099;, &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; &#1080; &#1090;&#1076;&lt;/li&gt;
	&lt;li&gt;&#1054;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1082;&#1088;&#1091;&#1090;&#1086; &lt;a href="http://www.douban.com/thing/"&gt;&#1074;&#1077;&#1097;&#1080;&lt;/a&gt;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1093;&#1086;&#1095;&#1077;&#1096;&#1100; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1080;&#1083;&#1080; &#1089;&#1076;&#1077;&#1083;&#1072;&#1083;: &#1073;&#1077;&#1075;, &#1087;&#1086;&#1093;&#1091;&#1076;&#1077;&#1090;&#1100;, &#1076;&#1077;&#1085;&#1100;&#1075;&#1080; &#1080; &#1090;&#1076;. &#1053;&#1091;&#1078;&#1085;&#1086; &#1074;&#1099;&#1073;&#1080;&#1088;&#1072;&#1090;&#1100; &#1080;&#1079; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;, &#1087;&#1086;&#1090;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080; &#1077;&#1076;&#1080;&#1085;&#1086;&#1084;&#1099;&#1096;&#1083;&#1077;&#1085;&#1085;&#1080;&#1082;&#1086;&#1074; &#1089; &#1090;&#1077;&#1084;&#1080; &#1078;&#1077; &#1085;&#1072;&#1084;&#1077;&#1088;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;.&lt;/li&gt;
	&lt;li&gt;&#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1087;&#1088;&#1086;&#1092;&#1080;&#1083;&#1100; &#1088;&#1072;&#1079;&#1073;&#1080;&#1090; &#1085;&#1072; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1099;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1089;&#1072;&#1081;&#1090;&#1091;. &#1042; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; &#1084;&#1091;&#1079;&#1099;&#1082;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1084;&#1091;&#1079;&#1099;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1088;&#1086;&#1092;&#1080;&#1083;&#1100;. &#1058;&#1086; &#1077;&#1089;&#1090;&#1100; &#1091; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1077;&#1089;&#1090;&#1100; &#1082;&#1091;&#1095;&#1072; &#1087;&#1088;&#1086;&#1092;&#1080;&#1083;&#1077;&#1081;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1080;&#1097;&#1093; &#1088;&#1072;&#1079;&#1085;&#1099;&#1084; &#1089;&#1092;&#1077;&#1088;&#1072;&#1084; &#1078;&#1080;&#1079;&#1085;&#1080;.&lt;/li&gt;
&lt;/ul&gt;</description><guid isPermaLink="true">http://qs.github.io04-07-2014/kitayskaya-sotsialnaya-set-douban-com.html</guid><pubDate>Fri, 04 Jul 2014 01:45:00 GMT</pubDate></item><item><title>Vypolni frontend</title><link>http://qs.github.io30-06-2014/vypolni-frontend.html</link><description>&lt;p&gt;&#1055;&#1088;&#1080;&#1096;&#1083;&#1086;&#1089;&#1100; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1089; &#1085;&#1091;&#1083;&#1103; &#1087;&#1086;&#1074;&#1086;&#1079;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074; &#1076;&#1078;&#1072;&#1074;&#1072;&#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1077;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1092;&#1088;&#1086;&#1085;&#1090;&#1077;&#1085;&#1076; &lt;a href="http://vypolni.appspot.com"&gt;Vypolni&lt;/a&gt;. &#1055;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1077; &#1096;&#1090;&#1091;&#1082;&#1080;:&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;jquery - &#1089;&#1072;&#1084;&#1086; &#1089;&#1086;&#1073;&#1086;&#1081;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1085;&#1077; &#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1082;&#1091;&#1095;&#1091; &#1089;&#1072;&#1084;&#1086;&#1087;&#1072;&#1083;&#1072;&lt;/li&gt;
	&lt;li&gt;jquery-ui - &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1096;&#1090;&#1091;&#1082;&#1072;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1076;&#1077;&#1072;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &lt;a href="http://api.jqueryui.com/sortable/"&gt;.sortable&lt;/a&gt;, &#1074; "start:" &#1087;&#1088;&#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1083;&#1105;&#1074;&#1099;&#1081; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090; &#1089; &#1085;&#1077;&#1088;&#1086;&#1074;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; (tilt), &#1082;&#1072;&#1082; &#1074; trello, &#1074; "stop:" &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;, &#1101;&#1092;&#1092;&#1077;&#1082;&#1090; &#1091;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090;&#1089;&#1103;. &#1040; &#1074; "receive:" &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1089;&#1072;&#1084; ajax, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089; &#1085;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1073;&#1072;&#1079;&#1077;.&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://touchpunch.furf.com/"&gt;jqueryui-touch-punch&lt;/a&gt; - &#1072; &#1073;&#1077;&#1079; &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1083;&#1089;&#1103; &#1085;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1085;&#1072; &#1090;&#1072;&#1095;-&#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1093;. &#1057; &#1085;&#1077;&#1081; (&#1074;&#1080;&#1076;&#1080;&#1084;&#1086; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; &#1086;&#1090; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1072;) &#1085;&#1072; &#1087;&#1083;&#1072;&#1085;&#1096;&#1077;&#1090;&#1077; &#1089;&#1083;&#1077;&#1075;&#1082;&#1072; &#1087;&#1086;&#1076;&#1090;&#1086;&#1088;&#1084;&#1072;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;. &#1045;&#1089;&#1090;&#1100; &#1084;&#1080;&#1085;&#1091;&#1089;: &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; ".disableSelection()", &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1085;&#1077; &#1076;&#1072;&#1077;&#1090; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090;.&lt;/li&gt;
	&lt;li&gt;&#1053;&#1077; &#1089;&#1072;&#1084;&#1099;&#1081; &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1099;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1074;&#1079;&#1103;&#1090;&#1100; &#1080;&#1076; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;: $(this).attr('id')&lt;/li&gt;
	&lt;li&gt;&#1055;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; html-&#1082;&#1086;&#1085;&#1090;&#1077;&#1085;&#1090; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080;: $("#current").html(), &#1091;&#1089;&#1090;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1082;&#1086;&#1085;&#1090;&#1077;&#1085;&#1090;: $("#current").html("&amp;lt;p&amp;gt;content&amp;lt;/p&amp;gt;")&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&#1063;&#1090;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1086;&#1075;&#1086; &#1077;&#1089;&#1090;&#1100; &#1074; &#1080;&#1090;&#1086;&#1075;&#1077; &#1074; &lt;a href="http://vypolni.appspot.com"&gt;Vypolni&lt;/a&gt;:&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&#1052;&#1086;&#1078;&#1085;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; &#1095;&#1077;&#1088;&#1077;&#1079; &#1074;&#1077;&#1073; &#1080;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1087;&#1080;&#1089;&#1100;&#1084;&#1072; &#1085;&#1072; mail@vypolni.appspotmail.com&lt;/li&gt;
	&lt;li&gt;&#1055;&#1088;&#1080; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1082;&#1077; &#1087;&#1080;&#1089;&#1100;&#1084;&#1072; &#1077;&#1084;&#1091; &#1074;&#1099;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1077;&#1075; "inbox", &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1090;&#1077;&#1075;&#1080; &#1095;&#1077;&#1088;&#1077;&#1079; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; &#1087;&#1080;&#1089;&#1100;&#1084;&#1072;: "&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; [tag1] [tag2]"&lt;/li&gt;
	&lt;li&gt;&#1052;&#1077;&#1085;&#1103;&#1090;&#1100; &#1089;&#1090;&#1072;&#1090;&#1091;&#1089;&#1099; &#1079;&#1072;&#1076;&#1072;&#1095; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1074; "current" &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1085;&#1072; &#1079;&#1072;&#1076;&#1072;&#1095;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1077;&#1097;&#1077; &#1086;&#1076;&#1085;&#1091;, &#1090;&#1086; &#1089;&#1090;&#1072;&#1088;&#1072;&#1103; &#1087;&#1077;&#1088;&#1077;&#1081;&#1076;&#1077;&#1090; &#1074; "background".&lt;/li&gt;
	&lt;li&gt;&#1053;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; &#1077;&#1089;&#1090;&#1100; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1089;&#1090;&#1072;&#1090;&#1091;&#1089;&#1086;&#1074;. &#1055;&#1086;&#1079;&#1078;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1102; &#1087;&#1086;&#1076;&#1089;&#1095;&#1077;&#1090; &#1089;&#1090;&#1072;&#1090;&#1080;&#1089;&#1090;&#1080;&#1082;&#1080; &#1087;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1076;&#1072;&#1095; &#1074; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;&#1077; &#1090;&#1077;&#1075;&#1086;&#1074; &#1080; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1089;&#1091;&#1090;&#1086;&#1082;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&#1052;&#1086;&#1078;&#1085;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1089;&#1074;&#1086;&#1102; &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; Vypolni &#1085;&#1072; &lt;a href="https://developers.google.com/appengine/"&gt;GAE&lt;/a&gt;, &#1082;&#1086;&#1076; &#1090;&#1091;&#1090;: &lt;a href="https://github.com/qs/vypolni"&gt;github.com/qs/vypolni&lt;/a&gt;.&lt;/p&gt;</description><guid isPermaLink="true">http://qs.github.io30-06-2014/vypolni-frontend.html</guid><pubDate>Mon, 30 Jun 2014 23:01:00 GMT</pubDate></item><item><title>&#1052;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1099; &#1087;&#1086; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</title><link>http://qs.github.io29-06-2014/materialy-po-analizu-dannyh.html</link><description>&lt;p&gt;&#1043;&#1072;&#1081;&#1076;&#1099; &#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;:&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&lt;a href="http://scikit-learn.org/stable/tutorial/basic/tutorial.html"&gt;scikit&lt;/a&gt; + &lt;a href="http://www.liangeugene.com/wp-content/uploads/2013/06/drop_shadows_background.png"&gt;&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1103; &#1087;&#1086; &#1074;&#1099;&#1073;&#1086;&#1088;&#1091; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072;&lt;/a&gt;. + &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;: &lt;a href="http://muricoca.github.io/crab/tutorial.html"&gt;Getting started: an introduction to recommender systems with Crab&lt;/a&gt;.&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://guidetodatamining.com/"&gt;A Programmer's Guide to Data Mining&lt;/a&gt; - &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1088;&#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1072;&#1094;&#1080;&#1081; &#1085;&#1072; &#1087;&#1080;&#1090;&#1086;&#1085;&#1077;, bayes, k-means&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://help.mortardata.com/data_apps/recommendation_engine"&gt;Build a Recommendation Engine with Free, Open Technologies&lt;/a&gt; - &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1072;&#1094;&#1080;&#1081; &#1085;&#1072; MongoDB, Hadoop, Mortar (Ruby)&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://homepages.inf.ed.ac.uk/rbf/IAPR/researchers/MLPAGES/mltut.htm"&gt;Tutorials on topics in machine learning&lt;/a&gt; - &#1085;&#1072; &#1086;&#1082;&#1086;&#1083;&#1086; 15 &#1090;&#1077;&#1084;, &#1077;&#1089;&#1090;&#1100; &#1077;&#1097;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1072; &#1074;&#1080;&#1076;&#1077;&#1086;-&#1091;&#1088;&#1086;&#1082;&#1080;.&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://jeroenjanssens.com/2013/09/19/seven-command-line-tools-for-data-science.html"&gt;7 command-line tools for data science&lt;/a&gt;:
	&lt;ul&gt;
		&lt;li&gt;jq - sed for JSON&lt;/li&gt;
		&lt;li&gt;json2csv - convert JSON to CSV&lt;/li&gt;
		&lt;li&gt;csvkit - suite of utilities for converting to and working with CSV&lt;/li&gt;
		&lt;li&gt;scrape - HTML extraction using XPath or CSS selectors&lt;/li&gt;
		&lt;li&gt;xml2json - convert XML to JSON&lt;/li&gt;
		&lt;li&gt;Rio - making R part of the pipeline+ &lt;a href="http://www.gregreda.com/2013/07/15/unix-commands-for-data-science/"&gt;&#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1077;&lt;/a&gt;: head &amp;amp; tail, wc, grep, sed, sort &amp;amp; uniq, awk&lt;/li&gt;
	&lt;/ul&gt;&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://onepager.togaware.com/"&gt;One Page R: A Survival Guide to Data Science with R&lt;/a&gt; - &#1089;&#1090;&#1072;&#1090;&#1100;&#1080; &#1080; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1072; &#1087;&#1086; R&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://togaware.com/datamining/survivor/Contents.html"&gt;Data Mining Desktop Survival Guide&lt;/a&gt; - &#1090;&#1072;&#1084; &#1078;&#1077;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090; &#1088;&#1072;&#1079;&#1085;&#1099;&#1081; &#1089;&#1086;&#1092;&#1090; &#1080; R&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://gerardnico.com/wiki/data_mining/algorithm"&gt;Data Mining - Algorithms&lt;/a&gt; - &#1089;&#1090;&#1072;&#1090;&#1080;&#1089;&#1090;&#1080;&#1082;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1086;&#1074;&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://www.kdnuggets.com/2014/05/guide-to-data-science-cheat-sheets.html"&gt;Guide to Data Science Cheat Sheets&lt;/a&gt; - &#1089;&#1090;&#1072;&#1090;&#1100;&#1103; &#1085;&#1072; kdnuggets: Selection of the most useful Data Science cheat sheets, covering SQL, Python (including NumPy, SciPy and Pandas), R (including Regression, Time Series, Data Mining), MATLAB, and more.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&#1041;&#1083;&#1086;&#1075;&#1080;:&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&lt;a href="http://playittodeath.ru/category/data-analysis-2/"&gt;playittodeath&lt;/a&gt; - &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1086;&#1074;, &#1085;&#1072; &#1088;&#1091;&#1089;&#1089;&#1082;&#1086;&#1084;&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://www.scoop.it/t/pdg"&gt;Kun Le&lt;/a&gt; - machine learning / big data&lt;/li&gt;
&lt;/ul&gt;</description><guid isPermaLink="true">http://qs.github.io29-06-2014/materialy-po-analizu-dannyh.html</guid><pubDate>Sun, 29 Jun 2014 07:49:00 GMT</pubDate></item><item><title>&#1048;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; 23-27 &#1080;&#1102;&#1085;&#1103;</title><link>http://qs.github.io27-06-2014/interesnye-ssylki-23-27-iyunya.html</link><description>&lt;p&gt;&#1048;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1080;&#1079; Python Weekly - Issue 145&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&lt;a href="https://github.com/machinalis/iepy"&gt;Information Extraction framework in Python&lt;/a&gt; &lt;a href="http://iepy.readthedocs.org/en/latest/tutorial.html"&gt;doc&lt;/a&gt; - &#1080;&#1079;&#1074;&#1083;&#1077;&#1082;&#1072;&#1077;&#1090; &#1092;&#1072;&#1082;&#1090;&#1099; &#1080;&#1079; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1085;&#1072; &#1072;&#1085;&#1075;&#1083;&#1080;&#1081;&#1089;&#1082;&#1086;&#1084; &#1074; &#1074;&#1080;&#1076;&#1077;: "Albert Einstein HAD-PROFESSION patent clerk". &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; mongodb, scipy &amp;amp; numpy.&lt;/li&gt;
	&lt;li&gt;&lt;a href="https://github.com/maebert/jrnl"&gt;jrnl&lt;/a&gt; - &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100;&#1085;&#1099;&#1081; &#1077;&#1078;&#1077;&#1076;&#1085;&#1077;&#1074;&#1085;&#1080;&#1082; &#1089; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; AES-256.&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://sebastianraschka.com/Articles/2014_multiprocessing_intro.html"&gt;multiprocessing&lt;/a&gt; - &#1074;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1074; &#1084;&#1091;&#1083;&#1100;&#1090;&#1080;&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1080;&#1085;&#1075;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; Pool.apply_async &#1080; Pool.map_async.&lt;/li&gt;
&lt;/ul&gt;</description><guid isPermaLink="true">http://qs.github.io27-06-2014/interesnye-ssylki-23-27-iyunya.html</guid><pubDate>Fri, 27 Jun 2014 22:01:00 GMT</pubDate></item><item><title>&#1056;&#1072;&#1079;&#1073;&#1086;&#1088; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &#1087;&#1086; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; 09-22 &#1080;&#1102;&#1085;&#1103;</title><link>http://qs.github.io23-06-2014/razbor-ssylok-po-analizu-dannyh-09-22-iyunya.html</link><description>&lt;p&gt;&#1056;&#1072;&#1079;&#1073;&#1086;&#1088; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &lt;a href="http://habrahabr.ru/post/227135/"&gt;http://habrahabr.ru/post/227135/&lt;/a&gt;&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;The First Law of Data Science: Correlation does not imply causation.&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://machinelearningmastery.com/machine-learning-for-money/"&gt;&#1050;&#1072;&#1082; &#1079;&#1072;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1085;&#1072; &#1084;&#1072;&#1096;&#1080;&#1085;&#1085;&#1086;&#1084; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1080;&lt;/a&gt; - &#1085;&#1072;&#1076;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;, &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1091;&#1102;&#1097;&#1080;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1080;&#1079; &#1072;&#1075;&#1088;&#1077;&#1075;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &lt;a href="http://kissmetrics.com"&gt;KissMetrics&lt;/a&gt;); &#1092;&#1080;&#1085;&#1072;&#1085;&#1089;&#1099; &#1080; &#1072;&#1079;&#1072;&#1088;&#1090;&#1085;&#1099;&#1077; &#1080;&#1075;&#1088;&#1099; (&#1088;&#1072;&#1079;&#1074;&#1077; &#1095;&#1090;&#1086; &#1074; &#1084;&#1084;&#1086;&#1088;&#1087;&#1075;, &#1075;&#1076;&#1077; &#1085;&#1080;&#1096;&#1072; &#1077;&#1097;&#1077; &#1085;&#1077; &#1079;&#1072;&#1085;&#1103;&#1090;&#1072;), &#1089;&#1072;&#1081;&#1090;&#1099; &#1089; &#1089;&#1086;&#1088;&#1077;&#1074;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;&#1084;&#1080;: &lt;a href="http://www.kaggle.com/"&gt;Kaggle&lt;/a&gt;, &lt;a href="https://challenge.gov"&gt;Challenge.gov&lt;/a&gt; (&#1090;&#1091;&#1090; &#1085;&#1072;&#1074;&#1077;&#1088;&#1085;&#1103;&#1082;&#1072; &#1085;&#1091;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1075;&#1088;&#1072;&#1078;&#1076;&#1072;&#1085;&#1080;&#1085;&#1086;&#1084;), &lt;a href="http://www.innocentive.com/"&gt;Innocentive&lt;/a&gt;, &lt;a href="http://tunedit.org/"&gt;Tunedit&lt;/a&gt;&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://nerds.airbnb.com/architecting-machine-learning-system-risk/"&gt;Architecting a Machine Learning System for Risk&lt;/a&gt; - &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1102;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &lt;a href="https://github.com/jpmml/openscoring"&gt;Openscoring&lt;/a&gt; &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &lt;a href="http://ru.wikipedia.org/wiki/%D0%AF%D0%B7%D1%8B%D0%BA_%D1%80%D0%B0%D0%B7%D0%BC%D0%B5%D1%82%D0%BA%D0%B8_%D0%BF%D1%80%D0%BE%D0%B3%D0%BD%D0%BE%D0%B7%D0%BD%D0%BE%D0%B3%D0%BE_%D0%BC%D0%BE%D0%B4%D0%B5%D0%BB%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D1%8F"&gt;PMML&lt;/a&gt;; "ground truth &amp;gt; features &amp;gt; algorithm choice"&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://machinelearningmastery.com/how-i-got-started-in-machine-learning/"&gt;How I Got Started In Machine Learning&lt;/a&gt;&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://www.cleveralgorithms.com/nature-inspired/index.html"&gt;Clever Algorithms: Nature-Inspired Programming Recipes&lt;/a&gt; - &#1082;&#1085;&#1080;&#1078;&#1082;&#1072; &#1087;&#1086; &#1048;&#1048;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&#1044;&#1072;&#1085;&#1085;&#1099;&#1077;:&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&lt;a href="http://en.wikipedia.org/wiki/Wikipedia:Database_download"&gt;Wikipedia:Database&lt;/a&gt; - &#1076;&#1072;&#1073;&#1087;&#1099; &#1089;&#1090;&#1072;&#1090;&#1077;&#1081; &#1074;&#1080;&#1082;&#1080;&#1087;&#1077;&#1076;&#1080;&#1080;.&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://www.dmoz.org/rdf.html"&gt;DMOZ&lt;/a&gt; - &#1076;&#1072;&#1084;&#1087; &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1080; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1081; &#1080; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082;.&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://www.bigdata-madesimple.com/70-websites-to-get-large-data-repositories-for-free/"&gt;&#1054;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;</description><guid isPermaLink="true">http://qs.github.io23-06-2014/razbor-ssylok-po-analizu-dannyh-09-22-iyunya.html</guid><pubDate>Mon, 23 Jun 2014 00:24:00 GMT</pubDate></item><item><title>&#1056;&#1072;&#1079;&#1073;&#1086;&#1088; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &#1087;&#1086; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</title><link>http://qs.github.io22-06-2014/razbor-ssylok-po-analizu-dannyh.html</link><description>&lt;p&gt;&#1048;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1080;&#1079; &#1076;&#1072;&#1081;&#1076;&#1078;&#1077;&#1089;&#1090;&#1072; &lt;a href="http://habrahabr.ru/post/226641/"&gt;http://habrahabr.ru/post/226641/&lt;/a&gt;&lt;/p&gt;

&lt;ul&gt;
	&lt;li&gt;&lt;a href="http://www.datasciencecentral.com/profiles/blogs/data-science-summer-reading-list-2014"&gt;&#1050;&#1085;&#1080;&#1075;&#1080; &#1087;&#1086; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;&lt;/a&gt; - &#1085;&#1077; &#1087;&#1088;&#1086; &#1057;&#1055;&#1054; &#1087;&#1086;&#1082;&#1072; &#1084;&#1080;&#1084;&#1086;.
	&lt;ul&gt;
		&lt;li&gt;&lt;a href="http://it-ebooks.info/book/3086/"&gt;Agile Data Science: Building Data Analytics Applications with Hadoop&lt;/a&gt; - &#1074;&#1089;&#1105; agile, &#1089;&#1091;&#1076;&#1103; &#1087;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1102; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100;, &#1087;&#1086;&#1084;&#1080;&#1084;&#1086; &#1093;&#1072;&#1076;&#1091;&#1087;&#1072; &#1082;&#1091;&#1095;&#1072; &#1087;&#1088;&#1080;&#1074;&#1099;&#1095;&#1085;&#1099;&#1093; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1093; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;.&lt;/li&gt;
		&lt;li&gt;&lt;a href="http://it-ebooks.info/book/666/"&gt;Machine Learning for Hackers&lt;/a&gt; - (book_id=666!) - R, &#1089;&#1087;&#1072;&#1084;-&#1092;&#1080;&#1083;&#1100;&#1090;&#1088;, priority box, &#1087;&#1088;&#1086;&#1075;&#1085;&#1086;&#1079; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;, &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072; kNN, &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1072;&#1094;&#1080;&#1080; &#1087;&#1086; &#1089;&#1086;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084;&#1091; &#1075;&#1088;&#1072;&#1092;&#1091;, SVM.&lt;/li&gt;
		&lt;li&gt;&lt;a href="http://www.amazon.com/dp/1594205655"&gt;Social Physics: How Good Ideas Spread&lt;/a&gt; - &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1086;, &#1085;&#1077; &#1085;&#1072;&#1096;&#1077;&#1083; pdf, &#1080; &#1090;&#1091;&#1090; &#1090;&#1086;&#1078;&#1077; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1083;&#1077;&#1074;&#1086;&#1077;: &lt;a href="http://www.amazon.com/dp/B00DMCW3N0/"&gt;The Naked Future: What Happens in a World That Anticipates Your Every Move?&lt;/a&gt;&lt;/li&gt;
		&lt;li&gt;&lt;a href="http://www.amazon.com/dp/1118810082"&gt;Developing Analytic Talent: Becoming a Data Scientist&lt;/a&gt; - &#1089;&#1091;&#1076;&#1103; &#1087;&#1086; &lt;a href="http://download.e-bookshelf.de/download/0002/3454/50/L-G-0002345450-0003216126.pdf"&gt;&#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1102;&lt;/a&gt; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1081; &#1075;&#1072;&#1081;&#1076;.&lt;/li&gt;
		&lt;li&gt;&lt;a href="http://www.amazon.com/dp/3659517542"&gt;Anomaly detection technique for sequential data&lt;/a&gt; - &#1090;&#1086;&#1078;&#1077; &#1085;&#1077; &#1085;&#1072;&#1096;&#1077;&#1083; pdf.&lt;/li&gt;
		&lt;li&gt;&lt;a href="http://it-ebooks.info/book/1041/"&gt;Python for Data Analysis&lt;/a&gt; - NumPy&lt;/li&gt;
	&lt;/ul&gt;&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://www.kdnuggets.com/2014/06/huge-big-data-poster.html"&gt;Huge Big Data Poster and Reference&lt;/a&gt; - &#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;: &#1074;&#1080;&#1079;&#1091;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103;: D3js, 3js, Gephi, Ozone; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;: R, Mahout, Titan, OpenCV, Lumify, Hive, Pig, &lt;a href="http://spark.apache.org/docs/latest/quick-start.html"&gt;Spark&lt;/a&gt;; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077;: HDFS, Accumulo, MongoDB, Cassandra, Titan, Neo4j, MySQL; &#1087;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1072; (ingest): &lt;a href="http://habrahabr.ru/post/128808/"&gt;Storm&lt;/a&gt;, Hadoop/MapReduce; &#1080;&#1085;&#1092;&#1088;&#1072;&#1089;&#1090;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072;: Linux, OpenShiW, OpenStack, Puppet, Zookeeper, Oozie, HDFS, KaZa, JBoss, Xymon (&#1079;&#1076;&#1077;&#1089;&#1100; &#1087;&#1086;&#1095;&#1090;&#1080; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1085;&#1077; &#1079;&#1085;&#1072;&#1102;).&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&#1045;&#1097;&#1077; &#1089;&#1087;&#1080;&#1089;&#1082;&#1080; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082;: &lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&lt;a href="http://www.datasciencecentral.com/profiles/blogs/comprehensive-list-of-data-science-resources"&gt;http://www.datasciencecentral.com/profiles/blogs/comprehensive-list-of-data-science-resources&lt;/a&gt;&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://www.datasciencecentral.com/profiles/blogs/another-set-of-great-articles-and-resources-mostly-external"&gt;http://www.datasciencecentral.com/profiles/blogs/another-set-of-great-articles-and-resources-mostly-external&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;</description><guid isPermaLink="true">http://qs.github.io22-06-2014/razbor-ssylok-po-analizu-dannyh.html</guid><pubDate>Sun, 22 Jun 2014 04:42:00 GMT</pubDate></item><item><title>&#1044;&#1086;&#1095;&#1080;&#1090;&#1072;&#1083; Code Complete</title><link>http://qs.github.io21-06-2014/dochital-code-complete.html</link><description>&lt;p&gt;&#1044;&#1086;&#1095;&#1080;&#1090;&#1072;&#1083; "&#1057;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076;". &#1048;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1086;&#1077; &#1085;&#1072;&#1095;&#1072;&#1083;&#1086; (&#1091;&#1088;&#1086;&#1074;&#1085;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1094;&#1080;&#1080;) &#1080; &#1073;&#1083;&#1080;&#1078;&#1077; &#1082; &#1082;&#1086;&#1085;&#1094;&#1091; (&#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;, &#1086;&#1090;&#1083;&#1072;&#1076;&#1082;&#1072;, &#1086;&#1094;&#1077;&#1085;&#1082;&#1072;, &#1087;&#1089;&#1080;&#1093;&#1086;&#1083;&#1086;&#1075;&#1080;&#1103;/&#1092;&#1080;&#1083;&#1086;&#1089;&#1086;&#1092;&#1080;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;). &#1055;&#1086;&#1085;&#1088;&#1072;&#1074;&#1080;&#1083;&#1080;&#1089;&#1100; &#1089;&#1090;&#1072;&#1090;&#1080;&#1089;&#1090;&#1080;&#1082;&#1080;, &#1102;&#1084;&#1086;&#1088;. &#1053;&#1077; &#1087;&#1086;&#1085;&#1088;&#1072;&#1074;&#1080;&#1083;&#1080;&#1089;&#1100; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1089;&#1086;&#1074;&#1077;&#1090;&#1099; &#1087;&#1086; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1102; &#1082;&#1086;&#1076;&#1072;. &#1042;&#1089;&#1077; &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1099;&#1077; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1099; &#1077;&#1097;&#1077; &#1088;&#1072;&#1079; &#1074; &#1086;&#1073;&#1097;&#1077;&#1084; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1077;&#1085;&#1099; &#1074; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1081; &#1075;&#1083;&#1072;&#1074;&#1077;.&lt;/p&gt;

&lt;p&gt;&#1054;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1087;&#1086;&#1085;&#1088;&#1072;&#1074;&#1080;&#1083;&#1080;&#1089;&#1100; &#1101;&#1090;&#1080; &#1080;&#1076;&#1077;&#1080;:&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&#1053;&#1091;&#1078;&#1085;&#1086; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1074;&#1089;&#1077; &#1087;&#1088;&#1086;&#1097;&#1077;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1085;&#1077; &#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1082;&#1091;&#1095;&#1091; &#1074;&#1077;&#1097;&#1077;&#1081; &#1074; &#1075;&#1086;&#1083;&#1086;&#1074;&#1077;.&lt;/li&gt;
	&lt;li&gt;&#1056;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1085;&#1072; &#1091;&#1088;&#1086;&#1074;&#1085;&#1080;: &#1086;&#1090; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1089; &#1054;&#1057; &#1076;&#1086; &#1075;&#1086;&#1090;&#1086;&#1074;&#1099;&#1093; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1081; &#1080; &#1073;&#1080;&#1079;&#1085;&#1077;&#1089;-&#1083;&#1086;&#1075;&#1080;&#1082;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1074; &#1094;&#1077;&#1083;&#1086;&#1084;.&lt;/li&gt;
	&lt;li&gt;&#1050;&#1091;&#1095;&#1091; &#1088;&#1072;&#1079; &#1091;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1077;&#1090;&#1089;&#1103; 80/20 &#1080; 7 &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1074; &#1075;&#1086;&#1083;&#1086;&#1074;&#1077;.&lt;/li&gt;
	&lt;li&gt;&#1053;&#1091;&#1078;&#1085;&#1086; &#1074;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100; &#1087;&#1086;&#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1084;&#1077;&#1090;&#1088;&#1080;&#1082; &#1076;&#1083;&#1103; &#1086;&#1094;&#1077;&#1085;&#1082;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1077;&#1089;&#1089;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1075;&#1086; &#1074;&#1099;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1072;&#1085;&#1086;&#1084;&#1072;&#1083;&#1080;&#1081;.&lt;/li&gt;
	&lt;li&gt;&#1050;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1090;&#1072;&#1082;&#1080;&#1084;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086; &#1085;&#1080;&#1084;.&lt;/li&gt;
	&lt;li&gt;&#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1085;&#1072; &#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1084; &#1091;&#1088;&#1086;&#1074;&#1085;&#1077; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1094;&#1080;&#1080;, &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;&#1100; &#1095;&#1090;&#1086; &#1080; &#1088;&#1072;&#1076;&#1080; &#1095;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090;, &#1072; &#1085;&#1077; &#1082;&#1072;&#1082;.&lt;/li&gt;
	&lt;li&gt;&#1053;&#1091;&#1078;&#1085;&#1086; &#1086;&#1073;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1083;&#1102;&#1076;&#1100;&#1084;&#1080;, &#1087;&#1077;&#1088;&#1077;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100; &#1080; &#1076;&#1077;&#1083;&#1080;&#1090;&#1100;&#1089;&#1103; &#1086;&#1087;&#1099;&#1090;&#1086;&#1084;. (&#1069;&#1090;&#1072; &#1078;&#1077; &#1080;&#1076;&#1077;&#1103; &#1073;&#1099;&#1083;&#1072; &#1074; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1082;&#1085;&#1080;&#1078;&#1082;&#1080; &#1087;&#1086; &#1057;/&#1057;++). &#1050;&#1086;&#1076;&#1080;&#1085;&#1075; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1086;&#1082;&#1086;&#1083;&#1086; 13% &#1086;&#1090; &#1074;&#1089;&#1077;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;.&lt;/li&gt;
	&lt;li&gt;&#1055;&#1072;&#1088;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080; &#1082;&#1086;&#1076; &#1088;&#1077;&#1074;&#1100;&#1102; &#1089;&#1080;&#1083;&#1100;&#1085;&#1086; &#1087;&#1086;&#1074;&#1099;&#1096;&#1072;&#1102;&#1090; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;, &#1085;&#1072;&#1088;&#1072;&#1074;&#1085;&#1077; &#1089; &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;.&lt;/li&gt;
&lt;/ul&gt;</description><guid isPermaLink="true">http://qs.github.io21-06-2014/dochital-code-complete.html</guid><pubDate>Sat, 21 Jun 2014 01:25:00 GMT</pubDate></item><item><title>&#1048;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1077; &#1089;&#1090;&#1072;&#1090;&#1100;&#1080; &#1085;&#1072; &#1093;&#1072;&#1073;&#1088;&#1077;</title><link>http://qs.github.io18-06-2014/interesnye-stati-na-habre.html</link><description>&lt;ul&gt;
	&lt;li&gt;&lt;a href="http://habrahabr.ru/post/226465/"&gt;10 &#1075;&#1083;&#1072;&#1074;&#1085;&#1099;&#1093; &#1074;&#1099;&#1074;&#1086;&#1076;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1103; &#1089;&#1076;&#1077;&#1083;&#1072;&#1083; &#1079;&#1072; &#1043;&#1086;&#1076; &#1048;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1055;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1089;&#1090;&#1080;&lt;/a&gt; - &#1085;&#1091;&#1078;&#1085;&#1086; &#1074;&#1099;&#1089;&#1090;&#1088;&#1072;&#1080;&#1074;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1102; &#1089;&#1090;&#1088;&#1072;&#1090;&#1077;&#1075;&#1080;&#1102;, &#1079;&#1085;&#1072;&#1090;&#1100; &#1094;&#1077;&#1083;&#1100;, &#1088;&#1072;&#1076;&#1080; &#1095;&#1077;&#1075;&#1086; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1095;&#1090;&#1086;-&#1090;&#1086; &#1076;&#1077;&#1083;&#1072;&#1077;&#1096;&#1100;, &#1087;&#1086;&#1076;&#1074;&#1077;&#1088;&#1075;&#1072;&#1090;&#1100; &#1089;&#1086;&#1084;&#1085;&#1077;&#1085;&#1080;&#1102; &#1089;&#1086;&#1074;&#1077;&#1090;&#1099; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1089;&#1087;&#1072;&#1090;&#1100;, &#1077;&#1089;&#1090;&#1100;, &#1076;&#1074;&#1080;&#1075;&#1072;&#1090;&#1100;&#1089;&#1103;. &#1045;&#1089;&#1090;&#1100; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1072; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1077; &#1101;&#1082;&#1087;&#1077;&#1088;&#1080;&#1084;&#1077;&#1085;&#1090;&#1099;.&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://habrahabr.ru/post/226419/"&gt;Django &#1085;&#1072; production. uWSGI + nginx. &#1055;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1077; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086;&lt;/a&gt; + &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1080;&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://habrahabr.ru/post/114745/"&gt;&#1053;&#1077;&#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1085;&#1086;&#1077; &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1080;&#1090;&#1086;&#1085;&#1086;&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;&lt;/a&gt; - &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &lt;a href="http://jenkins-ci.org/"&gt;jenkins&lt;/a&gt;, + (pyflakes, pep8,pylint, nosetests) + &#1076;&#1083;&#1103; &#1076;&#1078;&#1072;&#1085;&#1075;&#1080; &#1077;&#1089;&#1090;&#1100; &lt;a href="https://github.com/kmmbvnr/django-jenkins"&gt;django-jenkins&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;</description><guid isPermaLink="true">http://qs.github.io18-06-2014/interesnye-stati-na-habre.html</guid><pubDate>Wed, 18 Jun 2014 21:56:00 GMT</pubDate></item><item><title>&#1048;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1089; &#1093;&#1072;&#1073;&#1088;&#1072; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1084;&#1077;&#1089;&#1090;</title><link>http://qs.github.io15-06-2014/interesnye-ssylki-s-habra-i-drugih-mest.html</link><description>&lt;ul&gt;
	&lt;li&gt;&lt;a href="http://habrahabr.ru/post/225975/"&gt;&#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072; Secret.ly&lt;/a&gt; (&lt;a href="https://medium.com/@davidbyttow/demystifying-secret-12ab82fda29f"&gt;&#1086;&#1088;&#1080;&#1075;&#1080;&#1085;&#1072;&#1083;&lt;/a&gt;) - &#1056;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1085;&#1072; GAE &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085; &#1085;&#1072; Go. &#1047;&#1072;&#1097;&#1080;&#1097;&#1077;&#1085;&#1086; &lt;a href="https://developers.google.com/appengine/docs/ssl"&gt;TLS&lt;/a&gt;. &#1053;&#1086;&#1084;&#1077;&#1088;&#1072; &#1090;&#1077;&#1083;&#1077;&#1092;&#1086;&#1085;&#1086;&#1074; &#1093;&#1101;&#1096;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103;. "&#1042;&#1089;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1096;&#1080;&#1092;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076; &#1090;&#1077;&#1084;, &#1082;&#1072;&#1082; &#1073;&#1091;&#1076;&#1091;&#1090; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1099; &#1074; &#1073;&#1072;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1050;&#1083;&#1102;&#1095;&#1080; &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1085;&#1072; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1077;&#1084; &#1089;&#1077;&#1088;&#1074;&#1080;&#1089;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1088;&#1086;&#1090;&#1072;&#1094;&#1080;&#1102; &#1082;&#1083;&#1102;&#1095;&#1077;&#1081;." &#1048;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1079;&#1072; &#1089;&#1077;&#1088;&#1074;&#1080;&#1089;. &lt;a href="http://ru.wikipedia.org/wiki/%D0%9F%D1%80%D0%BE%D1%82%D0%BE%D0%BA%D0%BE%D0%BB_%D0%94%D0%B8%D1%84%D1%84%D0%B8_%E2%80%94_%D0%A5%D0%B5%D0%BB%D0%BB%D0%BC%D0%B0%D0%BD%D0%B0"&gt;&#1055;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083; &#1044;&#1080;&#1092;&#1092;&#1080;-&#1061;&#1077;&#1083;&#1083;&#1084;&#1072;&#1085;&#1072;&lt;/a&gt;.&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://www.appscale.com/blog/2013/10/24/top-10-ways-to-save-money-on-google-app-engine/"&gt;Top 10 Ways to Save Money on Google App Engine&lt;/a&gt; - &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; ndb, &#1082;&#1077;&#1096;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;, &#1084;&#1085;&#1086;&#1075;&#1086;&#1087;&#1086;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100; (threadsafe: false).&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://pyvideo.org/"&gt;pyvideo.org&lt;/a&gt; &#1080; &lt;a href="http://devcast.co/"&gt;devcast.co&lt;/a&gt; - &#1074;&#1080;&#1076;&#1077;&#1086; &#1076;&#1086;&#1082;&#1083;&#1072;&#1076;&#1086;&#1074; &#1089; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1082;&#1086;&#1085;&#1092;&#1077;&#1088;&#1077;&#1085;&#1094;&#1080;&#1081; &#1080; &#1084;&#1080;&#1090;&#1072;&#1087;&#1086;&#1074;.&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://siliconrus.com/2013/11/future-facebook/"&gt;&#1050;&#1072;&#1082;&#1086;&#1081; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1080;&#1076;&#1077;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1086;&#1094;&#1089;&#1077;&#1090;&#1100; &#1073;&#1091;&#1076;&#1091;&#1097;&#1077;&#1075;&#1086;?&lt;/a&gt;
	&lt;ul&gt;
		&lt;li&gt;&#1054;&#1090;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090; &#1074;&#1089;&#1077; &#1072;&#1089;&#1087;&#1077;&#1088;&#1082;&#1090;&#1099; &#1078;&#1080;&#1079;&#1085;&#1080;. &#1071; &#1076;&#1091;&#1084;&#1072;&#1083; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1092;&#1080;&#1083;&#1080;: &#1073;&#1077;&#1079; &#1082;&#1086;&#1085;&#1090;&#1072;&#1082;&#1085;&#1090;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1099; &#1080; &#1089;&#1074;&#1103;&#1079;&#1080; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1091;&#1102;&#1097;&#1077;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; (&#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1099; &#1080; &#1084;&#1077;&#1089;&#1090;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;). &#1058;&#1086; &#1077;&#1089;&#1090;&#1100; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099; - &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1088;&#1086;&#1092;&#1080;&#1083;&#1100;, &#1084;&#1077;&#1089;&#1090;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;/&#1086;&#1090;&#1076;&#1099;&#1093;&#1072;/&#1091;&#1095;&#1077;&#1073;&#1099; &#1080; &#1076;&#1088;&#1091;&#1075;&#1072;&#1103; &#1080;&#1085;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1091;&#1102;&#1097;&#1072;&#1103; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1072; &#1082; &#1083;&#1086;&#1082;&#1072;&#1094;&#1080;&#1080; - &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1087;&#1088;&#1086;&#1092;&#1080;&#1083;&#1100;.&lt;/li&gt;
		&lt;li&gt;&#1044;&#1086;&#1083;&#1078;&#1085;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1085;&#1072; &#1084;&#1086;&#1073;&#1080;&#1083;&#1100;&#1085;&#1099;&#1093;.&lt;/li&gt;
		&lt;li&gt;&#1051;&#1086;&#1082;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1072;&#1094;&#1080;&#1080;. &#1044;&#1083;&#1103; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1092;&#1080;&#1083;&#1103;.&lt;/li&gt;
		&lt;li&gt;&#1042;&#1083;&#1072;&#1076;&#1077;&#1085;&#1080;&#1077;. &#1055;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1072; &#1076;&#1086;&#1084;&#1077;&#1085;&#1072;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1072;&#1089;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1089;&#1077;&#1090;&#1080; &#1085;&#1072; &#1084;&#1072;&#1085;&#1077;&#1088; Tor &#1080;&#1083;&#1080; &lt;a href="http://ru.wikipedia.org/wiki/Diaspora_%28%D1%81%D0%BE%D1%86%D0%B8%D0%B0%D0%BB%D1%8C%D0%BD%D0%B0%D1%8F_%D1%81%D0%B5%D1%82%D1%8C%29"&gt;Diaspora&lt;/a&gt;.&lt;/li&gt;
		&lt;li&gt;&#1044;&#1086;&#1093;&#1086;&#1076; &#1080; &#1084;&#1086;&#1085;&#1077;&#1090;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103;. &#1055;&#1088;&#1080;&#1074;&#1083;&#1077;&#1082;&#1072;&#1077;&#1090; &#1083;&#1102;&#1076;&#1077;&#1081;, &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1102;&#1097;&#1080;&#1093; &#1082;&#1086;&#1085;&#1090;&#1077;&#1085;&#1090;, &#1089; &#1082;&#1091;&#1095;&#1077;&#1081; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1080; &#1089;&#1090;&#1080;&#1084;&#1091;&#1083;&#1080;&#1088;&#1091;&#1077;&#1090; &#1090;&#1077;&#1093;, &#1082;&#1090;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1085;&#1086;&#1088;&#1084; &#1082;&#1086;&#1085;&#1090;&#1077;&#1085;&#1090;.&lt;/li&gt;
	&lt;/ul&gt;&lt;/li&gt;
&lt;/ul&gt;</description><guid isPermaLink="true">http://qs.github.io15-06-2014/interesnye-ssylki-s-habra-i-drugih-mest.html</guid><pubDate>Sun, 15 Jun 2014 03:29:00 GMT</pubDate></item><item><title>&#1057;&#1089;&#1099;&#1083;&#1082;&#1080; &#1087;&#1086; &#1075;&#1077;&#1081;&#1084;&#1076;&#1077;&#1074;&#1091; &#1080; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1082;&#1072;&#1084;</title><link>http://qs.github.io14-06-2014/ssylki-po-geymdevu-i-brauzerkam.html</link><description>&lt;p&gt;&#1048;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1086; &#1087;&#1086;&#1087;&#1091;&#1083;&#1103;&#1088;&#1085;&#1099;&#1093; &#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1093; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1082;&#1072;&#1093;:&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&lt;a href="http://www.dtf.ru/articles/read.php?id=43159"&gt;&#1055;&#1086;&#1089;&#1090;&#1084;&#1086;&#1088;&#1090;&#1077;&#1084; TimeZero&lt;/a&gt; - &#1086; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077; &#1080;&#1075;&#1088;&#1099;&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://www.igromania.ru/articles/53735/Igraem_Ganja_Wars.htm"&gt;&#1057;&#1090;&#1072;&#1090;&#1100;&#1103; &#1085;&#1072; &#1080;&#1075;&#1088;&#1086;&#1084;&#1072;&#1085;&#1080;&#1080; &#1086; Ganja Wars&lt;/a&gt; - &#1080;&#1085;&#1090;&#1077;&#1088;&#1074;&#1100;&#1102; &#1089; &#1072;&#1074;&#1090;&#1086;&#1088;&#1086;&#1084;, &#1082;&#1088;&#1072;&#1090;&#1082;&#1086; &#1086; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1082;&#1077; &#1080;&#1075;&#1088;&#1099;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&#1057;&#1090;&#1072;&#1090;&#1100;&#1080; &#1087;&#1088;&#1086; &#1075;&#1077;&#1081;&#1084;&#1076;&#1077;&#1074;&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&lt;a href="http://www.dtf.ru/articles/read.php?id=73371"&gt;&#1042;&#1077;&#1082; &#1080;&#1075;&#1088;&#1072;&#1081; - &#1074;&#1077;&#1082; &#1091;&#1095;&#1080;&#1089;&#1100;. &#1050;&#1088;&#1080;&#1074;&#1072;&#1103; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1085;&#1099;&#1093; &#1080;&#1075;&#1088;&lt;/a&gt; - &#1074; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1085;&#1091;&#1078;&#1077;&#1085; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; &#1087;&#1086;&#1087;&#1088;&#1086;&#1097;&#1077;, &#1087;&#1086;&#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1085;&#1086; &#1080;&#1075;&#1088;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1086;&#1073;&#1088;&#1072;&#1089;&#1090;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1084;&#1080; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1086;&#1089;&#1090;&#1103;&#1084;&#1080;, &#1085;&#1086; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1089;&#1090;&#1072;&#1090;&#1100;&#1080; &#1087;&#1086; &#1090;&#1072;&#1082;&#1090;&#1080;&#1082;&#1077;.&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://www.dtf.ru/articles/read.php?id=47074"&gt;&#1041;&#1072;&#1083;&#1072;&#1085;&#1089; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081; &#1074; &#1080;&#1075;&#1088;&#1072;&#1093;&lt;/a&gt; - &#1087;&#1088;&#1086; &#1050;&#1053;&#1041;, &#1072;&#1083;&#1100;&#1090;&#1077;&#1088;&#1085;&#1072;&#1090;&#1080;&#1074;&#1072; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; "&#1073;&#1072;&#1083;&#1072;&#1085;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1086; &#1085;&#1072;&#1080;&#1090;&#1080;&#1102;" (&#1087;&#1086;&#1090;&#1077;&#1085;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1076;&#1080;&#1089;&#1073;&#1072;&#1083;&#1072;&#1085;&#1089;). &#1053;&#1091;&#1078;&#1085;&#1099; &#1090;&#1077;&#1089;&#1090;&#1099;. &#1061;&#1086;&#1095;&#1091; &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1082;&#1091; &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1077;&#1089;&#1072; &#1089;&#1090;&#1072;&#1090;&#1086;&#1074; &#1087;&#1086;&#1076;&#1075;&#1086;&#1085;&#1103;&#1083;&#1080;&#1089;&#1100; &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1090;&#1077;&#1089;&#1090;&#1086;&#1074; (&#1074;&#1080;&#1076;&#1080;&#1084;&#1086; &#1085;&#1077;&#1081;&#1088;&#1086;&#1089;&#1077;&#1090;&#1100; &#1085;&#1091;&#1078;&#1085;&#1072;).&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://www.dtf.ru/articles/read.php?id=44593"&gt;&#1063;&#1077;&#1088;&#1074;&#1080;, &#1090;&#1088;&#1077;&#1092;&#1099;, &#1073;&#1091;&#1073;&#1085;&#1099;, &#1087;&#1080;&#1082;&#1080;: &#1080;&#1075;&#1088;&#1086;&#1082;&#1080; &#1074;&#1080;&#1088;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1084;&#1080;&#1088;&#1086;&#1074;&lt;/a&gt; - &#1073;&#1086;&#1083;&#1100;&#1096;&#1072;&#1103; &#1089;&#1090;&#1072;&#1090;&#1100;&#1103; &#1087;&#1088;&#1086; &#1090;&#1080;&#1087;&#1099; &#1080;&#1075;&#1088;&#1086;&#1082;&#1086;&#1074; &#1080; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1090;&#1074;&#1080;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1089;&#1086;&#1073;&#1086;&#1081; &#1080; &#1084;&#1080;&#1088;&#1086;&#1084; &#1080;&#1075;&#1088;&#1099;.&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://www.dtf.ru/articles/read.php?id=44070&amp;amp;page=2"&gt;&#1055;&#1088;&#1086;&#1090;&#1086;&#1090;&#1080;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080;&#1075;&#1088;: &#1090;&#1077;&#1086;&#1088;&#1080;&#1103; &#1080; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1072;&lt;/a&gt; - &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1089;&#1077;&#1073;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1076;&#1083;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1073;&#1072;&#1083;&#1072;&#1085;&#1089;&#1072;, &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; (&#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103;, &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;) &#1089; &#1085;&#1086;&#1074;&#1099;&#1084;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;&#1080; (&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1099;, &#1087;&#1088;&#1077;&#1076;&#1084;&#1077;&#1090;&#1099;) &#1073;&#1077;&#1079; &#1085;&#1080;&#1079;&#1082;&#1086;&#1091;&#1088;&#1086;&#1074;&#1085;&#1077;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;. + &#1089;&#1072;&#1084;&#1086; &#1089;&#1086;&#1073;&#1086;&#1081; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088; &#1084;&#1080;&#1088;&#1072;/&#1091;&#1088;&#1086;&#1074;&#1085;&#1077;&#1081;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&#1048;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1086; &#1076;&#1086;&#1093;&#1086;&#1076;&#1072;&#1093;:&lt;br /&gt;
&#1056;&#1091;&#1089;&#1089;&#1082;&#1080;&#1077; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1082;&#1080; &#1085;&#1077; &#1087;&#1088;&#1077;&#1074;&#1099;&#1096;&#1072;&#1102;&#1090; 27 &#1090;&#1099;&#1089; &#1080;&#1075;&#1088;&#1086;&#1082;&#1086;&#1074; &#1074; &#1076;&#1077;&#1085;&#1100;. &#1053;&#1072; &#1074;&#1089;&#1077;&#1093; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072;&#1093; &#1088;&#1091;&#1089;&#1089;&#1082;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1083;&#1080;&#1085;&#1077;&#1081;&#1082;&#1080; &#1084;&#1077;&#1085;&#1077;&#1077; 100&#1090;&#1099;&#1089; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1093; &#1087;&#1077;&#1088;&#1089;&#1086;&#1085;&#1072;&#1078;&#1077;&#1081;. &#1042; EVE 300 000 &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1093; &#1080;&#1075;&#1088;&#1086;&#1082;&#1086;&#1074;. &#1042; &#1088;&#1091;&#1085;&#1089;&#1082;&#1077;&#1081;&#1087; 1.8&#1084;&#1083;&#1085; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1095;&#1080;&#1082;&#1086;&#1074; &#1087;&#1086; 10 &#1076;&#1086;&#1083;&#1083;&#1072;&#1088;&#1086;&#1074;. &#1052;&#1072;&#1081;&#1085;&#1082;&#1088;&#1072;&#1092;&#1090; &#1087;&#1088;&#1080;&#1085;&#1077;&#1089; 101&#1084;&#1083;&#1085; &#1076;&#1086;&#1083;&#1083;&#1072;&#1088;&#1086;&#1074; &#1079;&#1072; 2012 &#1075;&#1086;&#1076;.&lt;/p&gt;

&lt;p&gt;&#1062;&#1080;&#1090;&#1072;&#1090;&#1072; &#1053;&#1072;&#1087;&#1086;&#1083;&#1077;&#1086;&#1085;&#1072; &#1061;&#1080;&#1083;&#1083;&#1072;:&lt;br /&gt;
"&#1048;&#1089;&#1090;&#1086;&#1088;&#1080;&#1080; &#1082;&#1088;&#1091;&#1087;&#1085;&#1099;&#1093; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1081; &#1080;&#1084;&#1077;&#1102;&#1090; &#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1097;&#1077;&#1075;&#1086;: &#1090;&#1072;&#1082;, &#1074;&#1089;&#1077; &#1080;&#1093; &#1074;&#1083;&#1072;&#1076;&#1077;&#1083;&#1100;&#1094;&#1099; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1083;&#1077;&#1090;&#1091;, &#1085;&#1086; &#1082;&#1088;&#1072;&#1081;&#1085;&#1077; &#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1086; &#1080; &#1086;&#1089;&#1090;&#1086;&#1088;&#1086;&#1078;&#1085;&#1086; &#1080;&#1093; &#1084;&#1077;&#1085;&#1103;&#1102;&#1090;. &#1040; &#1074;&#1089;&#1077; &#1073;&#1077;&#1079; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077;&#1091;&#1076;&#1072;&#1095;&#1085;&#1080;&#1082;&#1080; &#1087;&#1086;&#1093;&#1086;&#1078;&#1080; &#1076;&#1088;&#1091;&#1075; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1072; &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1085;&#1086;&#1084;: &#1086;&#1085;&#1080; &#1082;&#1088;&#1072;&#1081;&#1085;&#1077; &#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1086; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;, &#1079;&#1072;&#1090;&#1086; &#1084;&#1077;&#1085;&#1103;&#1102;&#1090; &#1080;&#1093; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086; &#1080; &#1095;&#1072;&#1089;&#1090;&#1086;."&lt;/p&gt;</description><guid isPermaLink="true">http://qs.github.io14-06-2014/ssylki-po-geymdevu-i-brauzerkam.html</guid><pubDate>Sat, 14 Jun 2014 02:05:00 GMT</pubDate></item><item><title>&#1048;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1086;&#1077; &#1080;&#1079; Python Weekly - Issue 143</title><link>http://qs.github.io13-06-2014/interesoe-iz-python-weekly-issue-143.html</link><description>&lt;p&gt;&lt;a href="http://crossbar.io/"&gt;crossbar.io&lt;/a&gt; - &#1076;&#1083;&#1103; &#1088;&#1072;&#1089;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1084;&#1085;&#1086;&#1075;&#1086;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1093; &#1074;&#1077;&#1073;-&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; Twisted &#1080; &lt;a href="https://github.com/tavendo/AutobahnPython"&gt;Autobahn&lt;/a&gt;. &#1050;&#1086;&#1088;&#1086;&#1095;&#1077; &#1096;&#1090;&#1091;&#1082;&#1072; &#1076;&#1083;&#1103; WAMP.&lt;/p&gt;

&lt;p&gt;&lt;a href="http://labs.ideo.com/2014/06/04/painting-with-code/"&gt;&#1043;&#1077;&#1085;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1072;&#1085;&#1086;&#1077; &#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1090;&#1074;&#1086;&lt;/a&gt; - &#1088;&#1072;&#1089;&#1089;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; &#1087;&#1088;&#1086; &lt;a href="http://nodebox.net/code/index.php/Cornu"&gt;NodeBox&lt;/a&gt; - &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1083;&#1082;&#1091; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072;&#1084;&#1080; &#1076;&#1083;&#1103; Mac OS X, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1087;&#1080;&#1090;&#1086;&#1085;.&lt;/p&gt;

&lt;p&gt;&lt;a href="https://github.com/torque59/Nosql-Exploitation-Framework"&gt;NoSQL Scanning and Exploitation Framework&lt;/a&gt; - &#1076;&#1083;&#1103; Mongo, Couch, Redis, HBase, Cassandra&lt;/p&gt;</description><guid isPermaLink="true">http://qs.github.io13-06-2014/interesoe-iz-python-weekly-issue-143.html</guid><pubDate>Fri, 13 Jun 2014 16:28:00 GMT</pubDate></item><item><title>&#1056;&#1072;&#1079;&#1073;&#1086;&#1088; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &#1087;&#1086; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</title><link>http://qs.github.io10-06-2014/razbor-ssylok-po-analizu-dannyh.html</link><description>&lt;p&gt;&#1056;&#1072;&#1079;&#1073;&#1086;&#1088; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &#1089; &lt;a href="http://habrahabr.ru/post/225589/"&gt;http://habrahabr.ru/post/225589/&lt;/a&gt;&lt;/p&gt;

&lt;p&gt;&lt;a href="http://nosql-database.org/"&gt;&#1057;&#1087;&#1080;&#1089;&#1086;&#1082; NoSQL &#1073;&#1072;&#1079; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;&lt;/a&gt; - &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;, &#1087;&#1086;&#1084;&#1080;&#1084;&#1086; &#1073;&#1072;&#1079; &#1077;&#1089;&#1090;&#1100; &#1077;&#1097;&#1077; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; (&#1082;&#1086;&#1085;&#1092;&#1099;).&lt;br /&gt;
&#1061;&#1086;&#1088;&#1086;&#1096;&#1080;&#1077; &#1073;&#1072;&#1079;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1072;&#1076;&#1086; &#1080;&#1084;&#1077;&#1090;&#1100; &#1074;&#1074;&#1080;&#1076;&#1091;: &lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&#1089;&#1077;&#1084;&#1077;&#1081;&#1089;&#1090;&#1074;&#1072; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1086;&#1074;: HBase - &#1076;&#1083;&#1103; &#1093;&#1072;&#1076;&#1091;&#1087;&#1072;, Cassandra - &#1072;&#1085;&#1072;&#1083;&#1086;&#1075; hbase;&lt;/li&gt;
	&lt;li&gt;&#1076;&#1086;&#1082;.&#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077;: MongoDB - &#1082;&#1088;&#1091;&#1090;&#1086; &#1088;&#1072;&#1079;&#1074;&#1080;&#1090;, Elasticsearch - &#1076;&#1083;&#1103; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1093; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;/&#1083;&#1086;&#1075;&#1086;&#1074;;&lt;/li&gt;
	&lt;li&gt;&#1082;&#1083;&#1102;&#1095;-&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;: DynamoDB - "automatic ultra scalable", Riak - &#1074; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1080; &#1086;&#1090; Redis &#1077;&#1089;&#1090;&#1100; Multiple Masters, LevelDB - &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; &#1073;&#1080;&#1090;&#1082;&#1086;&#1080;&#1085;&#1072;&#1093;, &#1073;&#1072;&#1079; &#1082;&#1083;&#1102;&#1095;-&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1076;&#1086;&#1092;&#1080;&#1075;&#1072;.&lt;/li&gt;
	&lt;li&gt;&#1075;&#1088;&#1072;&#1092;&#1086;&#1074;&#1099;&#1077;: Neo4J - &#1082;&#1091;&#1095;&#1072; &#1074;&#1089;&#1077;&#1075;&#1086;, Infinite Graph - &#1090;&#1086;&#1078;&#1077;.&lt;/li&gt;
	&lt;li&gt;Multimodel Databases - &#1082;&#1088;&#1091;&#1090;&#1099;&#1077;, &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1077;&#1077; &#1088;&#1072;&#1079;&#1086;&#1073;&#1088;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080;: ArangoDB, AlchemyDB&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;a href="http://simplystatistics.org/2014/05/22/10-things-statistics-taught-us-about-big-data-analysis/"&gt;10 &#1074;&#1077;&#1097;&#1077;&#1081; &#1080;&#1079; &#1089;&#1090;&#1072;&#1090;&#1080;&#1089;&#1090;&#1080;&#1082;&#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1084;&#1099;&#1077; &#1087;&#1088;&#1080; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1077; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;&lt;/a&gt;&lt;/p&gt;
&lt;ol&gt;
	&lt;li&gt;&#1045;&#1089;&#1083;&#1080; &#1094;&#1077;&#1083;&#1100;&#1102; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;, &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1080;&#1079; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1084;&#1086;&#1076;&#1077;&#1083;&#1077;&#1081;.&lt;/li&gt;
	&lt;li&gt;&#1053;&#1091;&#1078;&#1085;&#1086; &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1084;&#1085;&#1086;&#1075;&#1086; &#1075;&#1080;&#1087;&#1086;&#1090;&#1077;&#1079; &#1085;&#1072; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1077; &#1090;&#1077;&#1089;&#1090;&#1086;&#1074;.&lt;/li&gt;
	&lt;li&gt;&#1045;&#1089;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1080; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077;, &#1085;&#1091;&#1078;&#1085;&#1086; &#1080;&#1079; &#1089;&#1075;&#1083;&#1072;&#1076;&#1080;&#1090;&#1100;: &lt;a href="http://www.people.fas.harvard.edu/~gov2000/Handouts/lowess.pdf"&gt;loess&lt;/a&gt;, &lt;a href="http://ru.wikipedia.org/wiki/%D0%A1%D0%B3%D0%BB%D0%B0%D0%B6%D0%B8%D0%B2%D0%B0%D1%8E%D1%89%D0%B8%D0%B9_%D1%81%D0%BF%D0%BB%D0%B0%D0%B9%D0%BD"&gt;&#1057;&#1075;&#1083;&#1072;&#1078;&#1080;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1089;&#1087;&#1083;&#1072;&#1081;&#1085;&lt;/a&gt;, &lt;a href="http://ru.wikipedia.org/wiki/%D0%A1%D0%BA%D0%BE%D0%BB%D1%8C%D0%B7%D1%8F%D1%89%D0%B0%D1%8F_%D1%81%D1%80%D0%B5%D0%B4%D0%BD%D1%8F%D1%8F"&gt;&#1057;&#1082;&#1086;&#1083;&#1100;&#1079;&#1103;&#1097;&#1072;&#1103; &#1089;&#1088;&#1077;&#1076;&#1085;&#1103;&#1103;&lt;/a&gt;, &lt;a href="http://ru.wikipedia.org/wiki/%D0%A1%D0%BA%D1%80%D1%8B%D1%82%D0%B0%D1%8F_%D0%BC%D0%B0%D1%80%D0%BA%D0%BE%D0%B2%D1%81%D0%BA%D0%B0%D1%8F_%D0%BC%D0%BE%D0%B4%D0%B5%D0%BB%D1%8C"&gt;&#1057;&#1082;&#1088;&#1099;&#1090;&#1072;&#1103; &#1084;&#1072;&#1088;&#1082;&#1086;&#1074;&#1089;&#1082;&#1072;&#1103; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100;&lt;/a&gt;&lt;/li&gt;
	&lt;li&gt;&#1055;&#1077;&#1088;&#1077;&#1076; &#1090;&#1077;&#1084;, &#1082;&#1072;&#1082; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;, &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1093; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100; &lt;a href="http://ru.wikipedia.org/wiki/%D0%9A%D0%B2%D0%B0%D1%80%D1%82%D0%B5%D1%82_%D0%AD%D0%BD%D1%81%D0%BA%D0%BE%D0%BC%D0%B1%D0%B0"&gt;&#1050;&#1074;&#1072;&#1088;&#1090;&#1077;&#1090; &#1069;&#1085;&#1089;&#1082;&#1086;&#1084;&#1073;&#1072;&lt;/a&gt;, &lt;a href="http://en.wikipedia.org/wiki/Bland%E2%80%93Altman_plot"&gt;Bland&#8211;Altman plot&lt;/a&gt;&lt;/li&gt;
	&lt;li&gt;&#1048;&#1053;&#1090;&#1077;&#1088;&#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079; - &#1083;&#1091;&#1095;&#1096;&#1080;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1074;&#1099;&#1103;&#1089;&#1085;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1089; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080;. (Robert Gentleman, Genentech: "make big data as small as possible as quick as is possible")&lt;/li&gt;
	&lt;li&gt;&#1053;&#1091;&#1078;&#1085;&#1086; &#1079;&#1085;&#1072;&#1090;&#1100; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1074;&#1099;&#1073;&#1086;&#1088;&#1082;&#1080;.&lt;/li&gt;
	&lt;li&gt;Unless you ran a randomized trial, potential confounders should keep you up at night&lt;/li&gt;
	&lt;li&gt;&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1084;&#1077;&#1090;&#1088;&#1080;&#1082;&#1091; &#1091;&#1089;&#1087;&#1077;&#1093;&#1072;&lt;/li&gt;
	&lt;li&gt;&#1053;&#1091;&#1078;&#1085;&#1086; &#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1082;&#1086;&#1076; &#1080; &#1086;&#1092;&#1086;&#1088;&#1084;&#1083;&#1103;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1073;&#1086;&#1083;&#1077;&#1077; &#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1077; &#1072;&#1085;&#1072;&#1083;&#1080;&#1090;&#1080;&#1082;&#1080; &#1084;&#1086;&#1075;&#1083;&#1080; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099;&lt;/li&gt;
	&lt;li&gt;&#1053;&#1091;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1088; &#1088;&#1072;&#1079;&#1085;&#1099;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1072; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1086;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1079;&#1085;&#1072;&#1077;&#1096;&#1100; &#1083;&#1091;&#1095;&#1096;&#1077;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;a href="https://medium.com/data-science-analytics/building-data-science-teams-f06352dcada8"&gt;Building Data Science Teams&lt;/a&gt;&lt;br /&gt;
&#1053;&#1091;&#1078;&#1085;&#1099;:&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;Data evangelist - &#1074;&#1099;&#1103;&#1089;&#1085;&#1103;&#1077;&#1090; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1085;&#1086;&#1089;&#1090;&#1080; &#1082;&#1083;&#1080;&#1077;&#1085;&#1090;&#1072;, &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&lt;/li&gt;
	&lt;li&gt;Contextual analyst - &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1085;&#1072;&#1076; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1072;, &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&lt;/li&gt;
	&lt;li&gt;Data visualizer - &#1076;&#1091;&#1084;&#1072;&#1077;&#1090;, &#1082;&#1072;&#1082; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1085;&#1086;&#1075;&#1086; &#1072;&#1085;&#1072;&#1083;&#1080;&#1090;&#1080;&#1082;&#1072; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;&#1084;&#1091; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1102;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;a href="http://www.datasciencecentral.com/profiles/blogs/continuing-along-the-path-of-data-science?xg_source=activity"&gt;&#1056;&#1072;&#1079;&#1074;&#1080;&#1090;&#1080;&#1077; &#1074; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;&lt;/a&gt; - &#1089;&#1086;&#1074;&#1077;&#1090;&#1099;, &#1082;&#1072;&#1082; &#1088;&#1072;&#1079;&#1074;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&#1044;&#1083;&#1103; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1085;&#1091;&#1078;&#1085;&#1086; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1074;&#1099;&#1091;&#1095;&#1080;&#1090;&#1100; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1103;&#1079;&#1099;&#1082; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; (Python) &#1080; SQL&lt;/li&gt;
	&lt;li&gt;&#1041;&#1099;&#1090;&#1100; &#1074; &#1082;&#1091;&#1088;&#1089;&#1077; &#1085;&#1086;&#1074;&#1099;&#1093; &#1090;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080;.&lt;/li&gt;
	&lt;li&gt;&#1061;&#1086;&#1076;&#1080;&#1090;&#1100; &#1085;&#1072; &#1074;&#1089;&#1090;&#1088;&#1077;&#1095;&#1080;, &#1082;&#1086;&#1085;&#1092;&#1077;&#1088;&#1077;&#1085;&#1094;&#1080;&#1080;, &#1093;&#1072;&#1082;&#1072;&#1090;&#1086;&#1085;&#1099;.&lt;/li&gt;
	&lt;li&gt;&#1055;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;. &#1045;&#1089;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1072;&#1103; &#1088;&#1072;&#1079;&#1085;&#1080;&#1094;&#1072; &#1084;&#1077;&#1078;&#1076;&#1091; &#1082;&#1091;&#1088;&#1089;&#1086;&#1074;&#1099;&#1084;&#1080; &#1074; MOOC &#1080; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1086;&#1084; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.&lt;/li&gt;
	&lt;li&gt;&#1055;&#1088;&#1080; &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1085;&#1077;&#1090; &#1095;&#1077;&#1090;&#1082;&#1086;&#1075;&#1086; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1072; &#1077;&#1077; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;a href="https://bigml.com"&gt;BigML&lt;/a&gt; - &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1076;&#1083;&#1103; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;&lt;/p&gt;

&lt;p&gt;&lt;a href="http://www.r-bloggers.com/statistical-language-wars-the-infograph/"&gt;&#1048;&#1085;&#1092;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1082;&#1072; &#1087;&#1086; &#1103;&#1079;&#1099;&#1082;&#1072;&#1084; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;&lt;/a&gt; - 50% &#1087;&#1086;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1083;&#1077;&#1081; Kaggle &#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; R. &#1048;&#1084; &#1078;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; Google &#1080; Facebook.&lt;/p&gt;

&lt;p&gt;&lt;a href="http://www.analyticsvidhya.com/blog/2014/06/books-data-scientists-or-aspiring-ones/"&gt;&#1050;&#1085;&#1080;&#1075;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100;&lt;/a&gt;&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;R Cookbook by Paul Teetor&lt;/li&gt;
	&lt;li&gt;Machine Learning for Hackers by Drew Conway &amp;amp; John Myles White&lt;/li&gt;
	&lt;li&gt;R graphics cookbook by Winston Chang&lt;/li&gt;
	&lt;li&gt;Programming Collective Intelligence by Toby Segaran - &#1095;&#1080;&#1090;&#1072;&#1083;.&lt;/li&gt;
	&lt;li&gt;Python for Data Analysis by Wes McKinney&lt;/li&gt;
	&lt;li&gt;Agile data science by Russell Jurney - &#1082;&#1083;&#1105;&#1074;&#1086;&#1077; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&lt;/li&gt;
	&lt;li&gt;Natural Language processing with Python by Steven Bird et al&lt;/li&gt;
	&lt;li&gt;Mining the social web by Matthew A. Russell - &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1095;&#1080;&#1090;&#1072;&#1083;, &#1087;&#1088;&#1086;&#1089;&#1090;&#1072;&#1103;, &#1085;&#1072; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072;&#1093;(&#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1082;&#1085;&#1080;&#1075;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1073;&#1099; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100;)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;a href="http://www.rdatamining.com/tutorials/r-hadoop-setup-guide"&gt;&#1055;&#1086;&#1096;&#1072;&#1075;&#1086;&#1074;&#1086;&#1077; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1077; R-Hadoop&lt;/a&gt;&lt;/p&gt;

&lt;p&gt;&lt;a href="http://rs.io/2014/05/29/list-of-data-sets.html"&gt;&#1053;&#1072;&#1073;&#1086;&#1088;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;&lt;/a&gt; - &#1086;&#1082;&#1086;&#1083;&#1086; &#1089;&#1086;&#1090;&#1085;&#1080;, &#1077;&#1089;&#1090;&#1100; &#1090;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1099;&#1083;&#1080; &#1074; &#1082;&#1086;&#1085;&#1082;&#1091;&#1088;&#1089;&#1072;&#1093; &#1085;&#1072; Kaggle.&lt;/p&gt;

&lt;p&gt;&lt;a href="http://www.datasciencecentral.com/profiles/blogs/acronyms-of-big-data-analytics-from-a-to-z?xg_source=activity"&gt;&#1040;&#1073;&#1073;&#1088;&#1077;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099; &#1074; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;&lt;/a&gt;&lt;/p&gt;</description><guid isPermaLink="true">http://qs.github.io10-06-2014/razbor-ssylok-po-analizu-dannyh.html</guid><pubDate>Tue, 10 Jun 2014 01:47:00 GMT</pubDate></item><item><title>&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1087;&#1086;&#1089;&#1090;. &#1055;&#1083;&#1072;&#1085;&#1099; &#1080; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080;</title><link>http://qs.github.io09-06-2014/pervyy-post-plany-i-interesnye-ssylki.html</link><description>&lt;p&gt;&#1053;&#1091;&#1078;&#1085;&#1086; &#1076;&#1086;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;:&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&lt;a href="https://github.com/qs/qs.github.io"&gt;Staticbl&lt;/a&gt; - &#1101;&#1090;&#1086;&#1090; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1085;&#1099;&#1081; &#1073;&#1083;&#1086;&#1075;. &#1053;&#1091;&#1078;&#1085;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072;, &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1077;&#1089;&#1090;&#1100;, &#1082;&#1072;&#1082; &#1089; &#1101;&#1090;&#1080;&#1084; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100;, &#1080; &#1090;&#1077;&#1089;&#1090;&#1099;.&lt;/li&gt;
	&lt;li&gt;&lt;a href="https://github.com/qs/vypolni"&gt;Vypolni&lt;/a&gt; - &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1103;&#1103; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1072; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1091;&#1076;&#1086;&#1073;&#1085;&#1099;&#1081; &#1084;&#1085;&#1077; &#1090;&#1072;&#1089;&#1082;-&#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088;. &#1054;&#1090;&#1074;&#1083;&#1077;&#1082;&#1072;&#1083;&#1089;&#1103; &#1086;&#1090; &#1077;&#1075;&#1086; &#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103;. &#1055;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1091;&#1078;&#1077; &#1077;&#1089;&#1090;&#1100;, &#1076;&#1086;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1080; &#1090;&#1086;&#1078;&#1077; &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1086;&#1082;&#1088;&#1099;&#1090;&#1100; &#1090;&#1077;&#1089;&#1090;&#1072;&#1084;&#1080;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&#1048;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1080; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086;&#1077;:&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&lt;a href="http://habrahabr.ru/post/225589/"&gt;&#1044;&#1072;&#1081;&#1076;&#1078;&#1077;&#1089;&#1090; &#1089;&#1090;&#1072;&#1090;&#1077;&#1081; &#1087;&#1086; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#8470;2&lt;/a&gt; - &#1085;&#1072; &#1093;&#1072;&#1073;&#1088;&#1077; &#1089;&#1090;&#1072;&#1083;&#1080; &#1077;&#1078;&#1077;&#1085;&#1077;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086; &#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1086; &#1088;&#1072;&#1079;&#1086;&#1073;&#1088;&#1072;&#1090;&#1100; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080;.&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://www.sicpers.info/2013/04/rebooting-the-programmer-competency-matrix/comment-page-1/"&gt;Rebooting the Programmer Competency Matrix&lt;/a&gt; - &#1093;&#1086;&#1095;&#1091; &#1086;&#1094;&#1077;&#1085;&#1080;&#1090;&#1100; &#1089;&#1077;&#1073;&#1103; &#1087;&#1086; &#1101;&#1090;&#1086;&#1081; &#1084;&#1072;&#1090;&#1088;&#1080;&#1094;&#1077; &#1080; &#1087;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080;.&lt;/li&gt;
&lt;/ul&gt;</description><guid isPermaLink="true">http://qs.github.io09-06-2014/pervyy-post-plany-i-interesnye-ssylki.html</guid><pubDate>Mon, 09 Jun 2014 02:25:00 GMT</pubDate></item></channel></rss>