<?xml version="1.0" encoding="iso-8859-1"?>
<rss version="2.0"><channel><title>qs notes</title><link>http://qs.github.io</link><description></description><lastBuildDate>Sat, 14 Jun 2014 02:06:48 GMT</lastBuildDate><generator>PyRSS2Gen-1.1.0</generator><docs>http://blogs.law.harvard.edu/tech/rss</docs><item><title>&#1057;&#1089;&#1099;&#1083;&#1082;&#1080; &#1087;&#1086; &#1075;&#1077;&#1081;&#1084;&#1076;&#1077;&#1074;&#1091; &#1080; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1082;&#1072;&#1084;</title><link>http://qs.github.io14-06-2014/ssylki-po-geymdevu-i-brauzerkam.html</link><description>&lt;p&gt;&#1048;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1086; &#1087;&#1086;&#1087;&#1091;&#1083;&#1103;&#1088;&#1085;&#1099;&#1093; &#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1093; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1082;&#1072;&#1093;:&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&lt;a href="http://www.dtf.ru/articles/read.php?id=43159"&gt;&#1055;&#1086;&#1089;&#1090;&#1084;&#1086;&#1088;&#1090;&#1077;&#1084; TimeZero&lt;/a&gt; - &#1086; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077; &#1080;&#1075;&#1088;&#1099;&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://www.igromania.ru/articles/53735/Igraem_Ganja_Wars.htm"&gt;&#1057;&#1090;&#1072;&#1090;&#1100;&#1103; &#1085;&#1072; &#1080;&#1075;&#1088;&#1086;&#1084;&#1072;&#1085;&#1080;&#1080; &#1086; Ganja Wars&lt;/a&gt; - &#1080;&#1085;&#1090;&#1077;&#1088;&#1074;&#1100;&#1102; &#1089; &#1072;&#1074;&#1090;&#1086;&#1088;&#1086;&#1084;, &#1082;&#1088;&#1072;&#1090;&#1082;&#1086; &#1086; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1082;&#1077; &#1080;&#1075;&#1088;&#1099;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&#1057;&#1090;&#1072;&#1090;&#1100;&#1080; &#1087;&#1088;&#1086; &#1075;&#1077;&#1081;&#1084;&#1076;&#1077;&#1074;&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&lt;a href="http://www.dtf.ru/articles/read.php?id=73371"&gt;&#1042;&#1077;&#1082; &#1080;&#1075;&#1088;&#1072;&#1081; - &#1074;&#1077;&#1082; &#1091;&#1095;&#1080;&#1089;&#1100;. &#1050;&#1088;&#1080;&#1074;&#1072;&#1103; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1085;&#1099;&#1093; &#1080;&#1075;&#1088;&lt;/a&gt; - &#1074; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1085;&#1091;&#1078;&#1077;&#1085; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; &#1087;&#1086;&#1087;&#1088;&#1086;&#1097;&#1077;, &#1087;&#1086;&#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1085;&#1086; &#1080;&#1075;&#1088;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1086;&#1073;&#1088;&#1072;&#1089;&#1090;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1084;&#1080; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1086;&#1089;&#1090;&#1103;&#1084;&#1080;, &#1085;&#1086; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1089;&#1090;&#1072;&#1090;&#1100;&#1080; &#1087;&#1086; &#1090;&#1072;&#1082;&#1090;&#1080;&#1082;&#1077;.&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://www.dtf.ru/articles/read.php?id=47074"&gt;&#1041;&#1072;&#1083;&#1072;&#1085;&#1089; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081; &#1074; &#1080;&#1075;&#1088;&#1072;&#1093;&lt;/a&gt; - &#1087;&#1088;&#1086; &#1050;&#1053;&#1041;, &#1072;&#1083;&#1100;&#1090;&#1077;&#1088;&#1085;&#1072;&#1090;&#1080;&#1074;&#1072; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; "&#1073;&#1072;&#1083;&#1072;&#1085;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1086; &#1085;&#1072;&#1080;&#1090;&#1080;&#1102;" (&#1087;&#1086;&#1090;&#1077;&#1085;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1076;&#1080;&#1089;&#1073;&#1072;&#1083;&#1072;&#1085;&#1089;). &#1053;&#1091;&#1078;&#1085;&#1099; &#1090;&#1077;&#1089;&#1090;&#1099;. &#1061;&#1086;&#1095;&#1091; &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1082;&#1091; &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1077;&#1089;&#1072; &#1089;&#1090;&#1072;&#1090;&#1086;&#1074; &#1087;&#1086;&#1076;&#1075;&#1086;&#1085;&#1103;&#1083;&#1080;&#1089;&#1100; &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1090;&#1077;&#1089;&#1090;&#1086;&#1074; (&#1074;&#1080;&#1076;&#1080;&#1084;&#1086; &#1085;&#1077;&#1081;&#1088;&#1086;&#1089;&#1077;&#1090;&#1100; &#1085;&#1091;&#1078;&#1085;&#1072;).&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://www.dtf.ru/articles/read.php?id=44593"&gt;&#1063;&#1077;&#1088;&#1074;&#1080;, &#1090;&#1088;&#1077;&#1092;&#1099;, &#1073;&#1091;&#1073;&#1085;&#1099;, &#1087;&#1080;&#1082;&#1080;: &#1080;&#1075;&#1088;&#1086;&#1082;&#1080; &#1074;&#1080;&#1088;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1084;&#1080;&#1088;&#1086;&#1074;&lt;/a&gt; - &#1073;&#1086;&#1083;&#1100;&#1096;&#1072;&#1103; &#1089;&#1090;&#1072;&#1090;&#1100;&#1103; &#1087;&#1088;&#1086; &#1090;&#1080;&#1087;&#1099; &#1080;&#1075;&#1088;&#1086;&#1082;&#1086;&#1074; &#1080; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1090;&#1074;&#1080;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1089;&#1086;&#1073;&#1086;&#1081; &#1080; &#1084;&#1080;&#1088;&#1086;&#1084; &#1080;&#1075;&#1088;&#1099;.&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://www.dtf.ru/articles/read.php?id=44070&amp;amp;page=2"&gt;&#1055;&#1088;&#1086;&#1090;&#1086;&#1090;&#1080;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080;&#1075;&#1088;: &#1090;&#1077;&#1086;&#1088;&#1080;&#1103; &#1080; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1072;&lt;/a&gt; - &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1089;&#1077;&#1073;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1076;&#1083;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1073;&#1072;&#1083;&#1072;&#1085;&#1089;&#1072;, &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; (&#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103;, &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;) &#1089; &#1085;&#1086;&#1074;&#1099;&#1084;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;&#1080; (&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1099;, &#1087;&#1088;&#1077;&#1076;&#1084;&#1077;&#1090;&#1099;) &#1073;&#1077;&#1079; &#1085;&#1080;&#1079;&#1082;&#1086;&#1091;&#1088;&#1086;&#1074;&#1085;&#1077;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;. + &#1089;&#1072;&#1084;&#1086; &#1089;&#1086;&#1073;&#1086;&#1081; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088; &#1084;&#1080;&#1088;&#1072;/&#1091;&#1088;&#1086;&#1074;&#1085;&#1077;&#1081;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&#1048;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1086; &#1076;&#1086;&#1093;&#1086;&#1076;&#1072;&#1093;:&lt;br /&gt;
&#1056;&#1091;&#1089;&#1089;&#1082;&#1080;&#1077; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1082;&#1080; &#1085;&#1077; &#1087;&#1088;&#1077;&#1074;&#1099;&#1096;&#1072;&#1102;&#1090; 27 &#1090;&#1099;&#1089; &#1080;&#1075;&#1088;&#1086;&#1082;&#1086;&#1074; &#1074; &#1076;&#1077;&#1085;&#1100;. &#1053;&#1072; &#1074;&#1089;&#1077;&#1093; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072;&#1093; &#1088;&#1091;&#1089;&#1089;&#1082;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1083;&#1080;&#1085;&#1077;&#1081;&#1082;&#1080; &#1084;&#1077;&#1085;&#1077;&#1077; 100&#1090;&#1099;&#1089; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1093; &#1087;&#1077;&#1088;&#1089;&#1086;&#1085;&#1072;&#1078;&#1077;&#1081;. &#1042; EVE 300 000 &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1093; &#1080;&#1075;&#1088;&#1086;&#1082;&#1086;&#1074;. &#1042; &#1088;&#1091;&#1085;&#1089;&#1082;&#1077;&#1081;&#1087; 1.8&#1084;&#1083;&#1085; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1095;&#1080;&#1082;&#1086;&#1074; &#1087;&#1086; 10 &#1076;&#1086;&#1083;&#1083;&#1072;&#1088;&#1086;&#1074;. &#1052;&#1072;&#1081;&#1085;&#1082;&#1088;&#1072;&#1092;&#1090; &#1087;&#1088;&#1080;&#1085;&#1077;&#1089; 101&#1084;&#1083;&#1085; &#1076;&#1086;&#1083;&#1083;&#1072;&#1088;&#1086;&#1074; &#1079;&#1072; 2012 &#1075;&#1086;&#1076;.&lt;/p&gt;

&lt;p&gt;&#1062;&#1080;&#1090;&#1072;&#1090;&#1072; &#1053;&#1072;&#1087;&#1086;&#1083;&#1077;&#1086;&#1085;&#1072; &#1061;&#1080;&#1083;&#1083;&#1072;:&lt;br /&gt;
"&#1048;&#1089;&#1090;&#1086;&#1088;&#1080;&#1080; &#1082;&#1088;&#1091;&#1087;&#1085;&#1099;&#1093; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1081; &#1080;&#1084;&#1077;&#1102;&#1090; &#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1097;&#1077;&#1075;&#1086;: &#1090;&#1072;&#1082;, &#1074;&#1089;&#1077; &#1080;&#1093; &#1074;&#1083;&#1072;&#1076;&#1077;&#1083;&#1100;&#1094;&#1099; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1083;&#1077;&#1090;&#1091;, &#1085;&#1086; &#1082;&#1088;&#1072;&#1081;&#1085;&#1077; &#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1086; &#1080; &#1086;&#1089;&#1090;&#1086;&#1088;&#1086;&#1078;&#1085;&#1086; &#1080;&#1093; &#1084;&#1077;&#1085;&#1103;&#1102;&#1090;. &#1040; &#1074;&#1089;&#1077; &#1073;&#1077;&#1079; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077;&#1091;&#1076;&#1072;&#1095;&#1085;&#1080;&#1082;&#1080; &#1087;&#1086;&#1093;&#1086;&#1078;&#1080; &#1076;&#1088;&#1091;&#1075; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1072; &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1085;&#1086;&#1084;: &#1086;&#1085;&#1080; &#1082;&#1088;&#1072;&#1081;&#1085;&#1077; &#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1086; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;, &#1079;&#1072;&#1090;&#1086; &#1084;&#1077;&#1085;&#1103;&#1102;&#1090; &#1080;&#1093; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086; &#1080; &#1095;&#1072;&#1089;&#1090;&#1086;."&lt;/p&gt;</description><guid isPermaLink="true">http://qs.github.io14-06-2014/ssylki-po-geymdevu-i-brauzerkam.html</guid><pubDate>Sat, 14 Jun 2014 02:05:00 GMT</pubDate></item><item><title>&#1048;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1086;&#1077; &#1080;&#1079; Python Weekly - Issue 143</title><link>http://qs.github.io13-06-2014/interesoe-iz-python-weekly-issue-143.html</link><description>&lt;p&gt;&lt;a href="http://crossbar.io/"&gt;crossbar.io&lt;/a&gt; - &#1076;&#1083;&#1103; &#1088;&#1072;&#1089;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1084;&#1085;&#1086;&#1075;&#1086;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1093; &#1074;&#1077;&#1073;-&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; Twisted &#1080; &lt;a href="https://github.com/tavendo/AutobahnPython"&gt;Autobahn&lt;/a&gt;. &#1050;&#1086;&#1088;&#1086;&#1095;&#1077; &#1096;&#1090;&#1091;&#1082;&#1072; &#1076;&#1083;&#1103; WAMP.&lt;/p&gt;

&lt;p&gt;&lt;a href="http://labs.ideo.com/2014/06/04/painting-with-code/"&gt;&#1043;&#1077;&#1085;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1072;&#1085;&#1086;&#1077; &#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1090;&#1074;&#1086;&lt;/a&gt; - &#1088;&#1072;&#1089;&#1089;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; &#1087;&#1088;&#1086; &lt;a href="http://nodebox.net/code/index.php/Cornu"&gt;NodeBox&lt;/a&gt; - &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1083;&#1082;&#1091; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072;&#1084;&#1080; &#1076;&#1083;&#1103; Mac OS X, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1087;&#1080;&#1090;&#1086;&#1085;.&lt;/p&gt;

&lt;p&gt;&lt;a href="https://github.com/torque59/Nosql-Exploitation-Framework"&gt;NoSQL Scanning and Exploitation Framework&lt;/a&gt; - &#1076;&#1083;&#1103; Mongo, Couch, Redis, HBase, Cassandra&lt;/p&gt;</description><guid isPermaLink="true">http://qs.github.io13-06-2014/interesoe-iz-python-weekly-issue-143.html</guid><pubDate>Fri, 13 Jun 2014 16:28:00 GMT</pubDate></item><item><title>&#1056;&#1072;&#1079;&#1073;&#1086;&#1088; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &#1087;&#1086; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</title><link>http://qs.github.io10-06-2014/razbor-ssylok-po-analizu-dannyh.html</link><description>&lt;p&gt;&#1056;&#1072;&#1079;&#1073;&#1086;&#1088; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &#1089; &lt;a href="http://habrahabr.ru/post/225589/"&gt;http://habrahabr.ru/post/225589/&lt;/a&gt;&lt;/p&gt;

&lt;p&gt;&lt;a href="http://nosql-database.org/"&gt;&#1057;&#1087;&#1080;&#1089;&#1086;&#1082; NoSQL &#1073;&#1072;&#1079; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;&lt;/a&gt; - &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;, &#1087;&#1086;&#1084;&#1080;&#1084;&#1086; &#1073;&#1072;&#1079; &#1077;&#1089;&#1090;&#1100; &#1077;&#1097;&#1077; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; (&#1082;&#1086;&#1085;&#1092;&#1099;).&lt;br /&gt;
&#1061;&#1086;&#1088;&#1086;&#1096;&#1080;&#1077; &#1073;&#1072;&#1079;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1072;&#1076;&#1086; &#1080;&#1084;&#1077;&#1090;&#1100; &#1074;&#1074;&#1080;&#1076;&#1091;: &lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&#1089;&#1077;&#1084;&#1077;&#1081;&#1089;&#1090;&#1074;&#1072; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1086;&#1074;: HBase - &#1076;&#1083;&#1103; &#1093;&#1072;&#1076;&#1091;&#1087;&#1072;, Cassandra - &#1072;&#1085;&#1072;&#1083;&#1086;&#1075; hbase;&lt;/li&gt;
	&lt;li&gt;&#1076;&#1086;&#1082;.&#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077;: MongoDB - &#1082;&#1088;&#1091;&#1090;&#1086; &#1088;&#1072;&#1079;&#1074;&#1080;&#1090;, Elasticsearch - &#1076;&#1083;&#1103; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1093; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;/&#1083;&#1086;&#1075;&#1086;&#1074;;&lt;/li&gt;
	&lt;li&gt;&#1082;&#1083;&#1102;&#1095;-&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;: DynamoDB - "automatic ultra scalable", Riak - &#1074; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1080; &#1086;&#1090; Redis &#1077;&#1089;&#1090;&#1100; Multiple Masters, LevelDB - &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; &#1073;&#1080;&#1090;&#1082;&#1086;&#1080;&#1085;&#1072;&#1093;, &#1073;&#1072;&#1079; &#1082;&#1083;&#1102;&#1095;-&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1076;&#1086;&#1092;&#1080;&#1075;&#1072;.&lt;/li&gt;
	&lt;li&gt;&#1075;&#1088;&#1072;&#1092;&#1086;&#1074;&#1099;&#1077;: Neo4J - &#1082;&#1091;&#1095;&#1072; &#1074;&#1089;&#1077;&#1075;&#1086;, Infinite Graph - &#1090;&#1086;&#1078;&#1077;.&lt;/li&gt;
	&lt;li&gt;Multimodel Databases - &#1082;&#1088;&#1091;&#1090;&#1099;&#1077;, &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1077;&#1077; &#1088;&#1072;&#1079;&#1086;&#1073;&#1088;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080;: ArangoDB, AlchemyDB&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;a href="http://simplystatistics.org/2014/05/22/10-things-statistics-taught-us-about-big-data-analysis/"&gt;10 &#1074;&#1077;&#1097;&#1077;&#1081; &#1080;&#1079; &#1089;&#1090;&#1072;&#1090;&#1080;&#1089;&#1090;&#1080;&#1082;&#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1084;&#1099;&#1077; &#1087;&#1088;&#1080; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1077; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;&lt;/a&gt;&lt;/p&gt;
&lt;ol&gt;
	&lt;li&gt;&#1045;&#1089;&#1083;&#1080; &#1094;&#1077;&#1083;&#1100;&#1102; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;, &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1080;&#1079; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1084;&#1086;&#1076;&#1077;&#1083;&#1077;&#1081;.&lt;/li&gt;
	&lt;li&gt;&#1053;&#1091;&#1078;&#1085;&#1086; &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1084;&#1085;&#1086;&#1075;&#1086; &#1075;&#1080;&#1087;&#1086;&#1090;&#1077;&#1079; &#1085;&#1072; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1077; &#1090;&#1077;&#1089;&#1090;&#1086;&#1074;.&lt;/li&gt;
	&lt;li&gt;&#1045;&#1089;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1080; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077;, &#1085;&#1091;&#1078;&#1085;&#1086; &#1080;&#1079; &#1089;&#1075;&#1083;&#1072;&#1076;&#1080;&#1090;&#1100;: &lt;a href="http://www.people.fas.harvard.edu/~gov2000/Handouts/lowess.pdf"&gt;loess&lt;/a&gt;, &lt;a href="http://ru.wikipedia.org/wiki/%D0%A1%D0%B3%D0%BB%D0%B0%D0%B6%D0%B8%D0%B2%D0%B0%D1%8E%D1%89%D0%B8%D0%B9_%D1%81%D0%BF%D0%BB%D0%B0%D0%B9%D0%BD"&gt;&#1057;&#1075;&#1083;&#1072;&#1078;&#1080;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1089;&#1087;&#1083;&#1072;&#1081;&#1085;&lt;/a&gt;, &lt;a href="http://ru.wikipedia.org/wiki/%D0%A1%D0%BA%D0%BE%D0%BB%D1%8C%D0%B7%D1%8F%D1%89%D0%B0%D1%8F_%D1%81%D1%80%D0%B5%D0%B4%D0%BD%D1%8F%D1%8F"&gt;&#1057;&#1082;&#1086;&#1083;&#1100;&#1079;&#1103;&#1097;&#1072;&#1103; &#1089;&#1088;&#1077;&#1076;&#1085;&#1103;&#1103;&lt;/a&gt;, &lt;a href="http://ru.wikipedia.org/wiki/%D0%A1%D0%BA%D1%80%D1%8B%D1%82%D0%B0%D1%8F_%D0%BC%D0%B0%D1%80%D0%BA%D0%BE%D0%B2%D1%81%D0%BA%D0%B0%D1%8F_%D0%BC%D0%BE%D0%B4%D0%B5%D0%BB%D1%8C"&gt;&#1057;&#1082;&#1088;&#1099;&#1090;&#1072;&#1103; &#1084;&#1072;&#1088;&#1082;&#1086;&#1074;&#1089;&#1082;&#1072;&#1103; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100;&lt;/a&gt;&lt;/li&gt;
	&lt;li&gt;&#1055;&#1077;&#1088;&#1077;&#1076; &#1090;&#1077;&#1084;, &#1082;&#1072;&#1082; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;, &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1093; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100; &lt;a href="http://ru.wikipedia.org/wiki/%D0%9A%D0%B2%D0%B0%D1%80%D1%82%D0%B5%D1%82_%D0%AD%D0%BD%D1%81%D0%BA%D0%BE%D0%BC%D0%B1%D0%B0"&gt;&#1050;&#1074;&#1072;&#1088;&#1090;&#1077;&#1090; &#1069;&#1085;&#1089;&#1082;&#1086;&#1084;&#1073;&#1072;&lt;/a&gt;, &lt;a href="http://en.wikipedia.org/wiki/Bland%E2%80%93Altman_plot"&gt;Bland&#8211;Altman plot&lt;/a&gt;&lt;/li&gt;
	&lt;li&gt;&#1048;&#1053;&#1090;&#1077;&#1088;&#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079; - &#1083;&#1091;&#1095;&#1096;&#1080;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1074;&#1099;&#1103;&#1089;&#1085;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1089; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080;. (Robert Gentleman, Genentech: "make big data as small as possible as quick as is possible")&lt;/li&gt;
	&lt;li&gt;&#1053;&#1091;&#1078;&#1085;&#1086; &#1079;&#1085;&#1072;&#1090;&#1100; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1074;&#1099;&#1073;&#1086;&#1088;&#1082;&#1080;.&lt;/li&gt;
	&lt;li&gt;Unless you ran a randomized trial, potential confounders should keep you up at night&lt;/li&gt;
	&lt;li&gt;&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1084;&#1077;&#1090;&#1088;&#1080;&#1082;&#1091; &#1091;&#1089;&#1087;&#1077;&#1093;&#1072;&lt;/li&gt;
	&lt;li&gt;&#1053;&#1091;&#1078;&#1085;&#1086; &#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1082;&#1086;&#1076; &#1080; &#1086;&#1092;&#1086;&#1088;&#1084;&#1083;&#1103;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1073;&#1086;&#1083;&#1077;&#1077; &#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1077; &#1072;&#1085;&#1072;&#1083;&#1080;&#1090;&#1080;&#1082;&#1080; &#1084;&#1086;&#1075;&#1083;&#1080; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099;&lt;/li&gt;
	&lt;li&gt;&#1053;&#1091;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1088; &#1088;&#1072;&#1079;&#1085;&#1099;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1072; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1086;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1079;&#1085;&#1072;&#1077;&#1096;&#1100; &#1083;&#1091;&#1095;&#1096;&#1077;.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;a href="https://medium.com/data-science-analytics/building-data-science-teams-f06352dcada8"&gt;Building Data Science Teams&lt;/a&gt;&lt;br /&gt;
&#1053;&#1091;&#1078;&#1085;&#1099;:&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;Data evangelist - &#1074;&#1099;&#1103;&#1089;&#1085;&#1103;&#1077;&#1090; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1085;&#1086;&#1089;&#1090;&#1080; &#1082;&#1083;&#1080;&#1077;&#1085;&#1090;&#1072;, &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&lt;/li&gt;
	&lt;li&gt;Contextual analyst - &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1085;&#1072;&#1076; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1072;, &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&lt;/li&gt;
	&lt;li&gt;Data visualizer - &#1076;&#1091;&#1084;&#1072;&#1077;&#1090;, &#1082;&#1072;&#1082; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1085;&#1086;&#1075;&#1086; &#1072;&#1085;&#1072;&#1083;&#1080;&#1090;&#1080;&#1082;&#1072; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;&#1084;&#1091; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1102;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;a href="http://www.datasciencecentral.com/profiles/blogs/continuing-along-the-path-of-data-science?xg_source=activity"&gt;&#1056;&#1072;&#1079;&#1074;&#1080;&#1090;&#1080;&#1077; &#1074; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;&lt;/a&gt; - &#1089;&#1086;&#1074;&#1077;&#1090;&#1099;, &#1082;&#1072;&#1082; &#1088;&#1072;&#1079;&#1074;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&#1044;&#1083;&#1103; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1085;&#1091;&#1078;&#1085;&#1086; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1074;&#1099;&#1091;&#1095;&#1080;&#1090;&#1100; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1103;&#1079;&#1099;&#1082; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; (Python) &#1080; SQL&lt;/li&gt;
	&lt;li&gt;&#1041;&#1099;&#1090;&#1100; &#1074; &#1082;&#1091;&#1088;&#1089;&#1077; &#1085;&#1086;&#1074;&#1099;&#1093; &#1090;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080;.&lt;/li&gt;
	&lt;li&gt;&#1061;&#1086;&#1076;&#1080;&#1090;&#1100; &#1085;&#1072; &#1074;&#1089;&#1090;&#1088;&#1077;&#1095;&#1080;, &#1082;&#1086;&#1085;&#1092;&#1077;&#1088;&#1077;&#1085;&#1094;&#1080;&#1080;, &#1093;&#1072;&#1082;&#1072;&#1090;&#1086;&#1085;&#1099;.&lt;/li&gt;
	&lt;li&gt;&#1055;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;. &#1045;&#1089;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1072;&#1103; &#1088;&#1072;&#1079;&#1085;&#1080;&#1094;&#1072; &#1084;&#1077;&#1078;&#1076;&#1091; &#1082;&#1091;&#1088;&#1089;&#1086;&#1074;&#1099;&#1084;&#1080; &#1074; MOOC &#1080; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1086;&#1084; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.&lt;/li&gt;
	&lt;li&gt;&#1055;&#1088;&#1080; &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1085;&#1077;&#1090; &#1095;&#1077;&#1090;&#1082;&#1086;&#1075;&#1086; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1072; &#1077;&#1077; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;a href="https://bigml.com"&gt;BigML&lt;/a&gt; - &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1076;&#1083;&#1103; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;&lt;/p&gt;

&lt;p&gt;&lt;a href="http://www.r-bloggers.com/statistical-language-wars-the-infograph/"&gt;&#1048;&#1085;&#1092;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1082;&#1072; &#1087;&#1086; &#1103;&#1079;&#1099;&#1082;&#1072;&#1084; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;&lt;/a&gt; - 50% &#1087;&#1086;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1083;&#1077;&#1081; Kaggle &#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; R. &#1048;&#1084; &#1078;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; Google &#1080; Facebook.&lt;/p&gt;

&lt;p&gt;&lt;a href="http://www.analyticsvidhya.com/blog/2014/06/books-data-scientists-or-aspiring-ones/"&gt;&#1050;&#1085;&#1080;&#1075;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100;&lt;/a&gt;&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;R Cookbook by Paul Teetor&lt;/li&gt;
	&lt;li&gt;Machine Learning for Hackers by Drew Conway &amp;amp; John Myles White&lt;/li&gt;
	&lt;li&gt;R graphics cookbook by Winston Chang&lt;/li&gt;
	&lt;li&gt;Programming Collective Intelligence by Toby Segaran - &#1095;&#1080;&#1090;&#1072;&#1083;.&lt;/li&gt;
	&lt;li&gt;Python for Data Analysis by Wes McKinney&lt;/li&gt;
	&lt;li&gt;Agile data science by Russell Jurney - &#1082;&#1083;&#1105;&#1074;&#1086;&#1077; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&lt;/li&gt;
	&lt;li&gt;Natural Language processing with Python by Steven Bird et al&lt;/li&gt;
	&lt;li&gt;Mining the social web by Matthew A. Russell - &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1095;&#1080;&#1090;&#1072;&#1083;, &#1087;&#1088;&#1086;&#1089;&#1090;&#1072;&#1103;, &#1085;&#1072; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072;&#1093;(&#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1082;&#1085;&#1080;&#1075;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1073;&#1099; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100;)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;a href="http://www.rdatamining.com/tutorials/r-hadoop-setup-guide"&gt;&#1055;&#1086;&#1096;&#1072;&#1075;&#1086;&#1074;&#1086;&#1077; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1077; R-Hadoop&lt;/a&gt;&lt;/p&gt;

&lt;p&gt;&lt;a href="http://rs.io/2014/05/29/list-of-data-sets.html"&gt;&#1053;&#1072;&#1073;&#1086;&#1088;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;&lt;/a&gt; - &#1086;&#1082;&#1086;&#1083;&#1086; &#1089;&#1086;&#1090;&#1085;&#1080;, &#1077;&#1089;&#1090;&#1100; &#1090;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1099;&#1083;&#1080; &#1074; &#1082;&#1086;&#1085;&#1082;&#1091;&#1088;&#1089;&#1072;&#1093; &#1085;&#1072; Kaggle.&lt;/p&gt;

&lt;p&gt;&lt;a href="http://www.datasciencecentral.com/profiles/blogs/acronyms-of-big-data-analytics-from-a-to-z?xg_source=activity"&gt;&#1040;&#1073;&#1073;&#1088;&#1077;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099; &#1074; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;&lt;/a&gt;&lt;/p&gt;</description><guid isPermaLink="true">http://qs.github.io10-06-2014/razbor-ssylok-po-analizu-dannyh.html</guid><pubDate>Tue, 10 Jun 2014 01:47:00 GMT</pubDate></item><item><title>&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1087;&#1086;&#1089;&#1090;. &#1055;&#1083;&#1072;&#1085;&#1099; &#1080; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080;</title><link>http://qs.github.io09-06-2014/pervyy-post-plany-i-interesnye-ssylki.html</link><description>&lt;p&gt;&#1053;&#1091;&#1078;&#1085;&#1086; &#1076;&#1086;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;:&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&lt;a href="https://github.com/qs/qs.github.io"&gt;Staticbl&lt;/a&gt; - &#1101;&#1090;&#1086;&#1090; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1085;&#1099;&#1081; &#1073;&#1083;&#1086;&#1075;. &#1053;&#1091;&#1078;&#1085;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072;, &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1077;&#1089;&#1090;&#1100;, &#1082;&#1072;&#1082; &#1089; &#1101;&#1090;&#1080;&#1084; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100;, &#1080; &#1090;&#1077;&#1089;&#1090;&#1099;.&lt;/li&gt;
	&lt;li&gt;&lt;a href="https://github.com/qs/vypolni"&gt;Vypolni&lt;/a&gt; - &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1103;&#1103; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1072; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1091;&#1076;&#1086;&#1073;&#1085;&#1099;&#1081; &#1084;&#1085;&#1077; &#1090;&#1072;&#1089;&#1082;-&#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088;. &#1054;&#1090;&#1074;&#1083;&#1077;&#1082;&#1072;&#1083;&#1089;&#1103; &#1086;&#1090; &#1077;&#1075;&#1086; &#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103;. &#1055;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1091;&#1078;&#1077; &#1077;&#1089;&#1090;&#1100;, &#1076;&#1086;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1080; &#1090;&#1086;&#1078;&#1077; &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1086;&#1082;&#1088;&#1099;&#1090;&#1100; &#1090;&#1077;&#1089;&#1090;&#1072;&#1084;&#1080;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&#1048;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1080; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086;&#1077;:&lt;/p&gt;
&lt;ul&gt;
	&lt;li&gt;&lt;a href="http://habrahabr.ru/post/225589/"&gt;&#1044;&#1072;&#1081;&#1076;&#1078;&#1077;&#1089;&#1090; &#1089;&#1090;&#1072;&#1090;&#1077;&#1081; &#1087;&#1086; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#8470;2&lt;/a&gt; - &#1085;&#1072; &#1093;&#1072;&#1073;&#1088;&#1077; &#1089;&#1090;&#1072;&#1083;&#1080; &#1077;&#1078;&#1077;&#1085;&#1077;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086; &#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1086; &#1088;&#1072;&#1079;&#1086;&#1073;&#1088;&#1072;&#1090;&#1100; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080;.&lt;/li&gt;
	&lt;li&gt;&lt;a href="http://www.sicpers.info/2013/04/rebooting-the-programmer-competency-matrix/comment-page-1/"&gt;Rebooting the Programmer Competency Matrix&lt;/a&gt; - &#1093;&#1086;&#1095;&#1091; &#1086;&#1094;&#1077;&#1085;&#1080;&#1090;&#1100; &#1089;&#1077;&#1073;&#1103; &#1087;&#1086; &#1101;&#1090;&#1086;&#1081; &#1084;&#1072;&#1090;&#1088;&#1080;&#1094;&#1077; &#1080; &#1087;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080;.&lt;/li&gt;
&lt;/ul&gt;</description><guid isPermaLink="true">http://qs.github.io09-06-2014/pervyy-post-plany-i-interesnye-ssylki.html</guid><pubDate>Mon, 09 Jun 2014 02:25:00 GMT</pubDate></item></channel></rss>